<?php

return [
    'title' => 'Функция Аккермана',
    'description' => [
        '1' =>
        "Следующая процедура вычисляет математическую функцию, называемую функцией Аккермана.",
        '2' =>
        "Каковы значения следующих выражений?",
        '3' =>
        "Рассмотрим следующие процедуры, где ",
        '4' =>
        " — процедура, определенная выше:",
        '5' =>
        "Дайте краткие математические определения функций, вычисляемых процедурами ",
        '6' =>
        " и ",
        '7' =>
        " для положительных целых значений ",
        '8' =>
        ". Например, ",
        '9' =>
        " вычисляет",
        '10' =>
        ".",
    ],
];
