<?php

return [
    'title' => 'Итеративные и рекурсивные процессы',
    'description' => [
        '1' =>
        'Функция ',
        '2' =>
        ' определяется правилом: ',
        '3' =>
        ', если ',
        '4' =>
        ', и ',
        '5' =>
        ', если ',
        '6' =>
        '. Напишите процедуру ',
        '7' =>
        ', вычисляющую ',
        '8' =>
        ' с помощью рекурсивного процесса. Напишите процедуру ',
        '9' =>
        ', вычисляющую ',
        '10' =>
        ' с помощью итеративного процесса.',
    ],
];
