<?php

return [
    'title' => 'Синус угла',
    'description' => [
        '1' =>
        "Синус угла (заданного в радианах) можно вычислить, если воспользоваться приближением ",
        '2' =>
        " при малых ",
        '3' =>
        " и употребить тригонометрическое тождество",
        '4' =>
        "для уменьшения значения аргумента ",
        '5' =>
        ". (В этом упражнении мы будем считать, что угол «достаточно мал», если он не больше 0.1 радиана.) " .
        "Эта идея используется в следующих процедурах:",
        '6' =>
        "а. Сколько раз вызывается процедура ",
        '7' =>
        " при вычислении ",
        '8' =>
        "?",
        '9' =>
        "б. Каковы порядки роста в терминах количества шагов и используемой памяти (как функция ",
        '10' =>
        ") для процесса, порождаемого процедурой ",
        '11' =>
        " при вычислении ",
        '12' =>
        "?",
    ],
];
