<?php

return [
    'title' => 'Быстрое возведение в степень',
    'description' => [
        '1' =>
        'Напишите процедуру ',
        '2' =>
        ', которая развивается в виде итеративного процесса и реализует возведение в степень за логарифмическое число шагов, как ',
        '3' =>
        ' (Указание: используя наблюдение, что ',
        '4' =>
        ', храните, помимо значения степени ',
        '5' =>
        ' и основания ',
        '6' =>
        ', дополнительную переменную состояния ',
        '7' =>
        ', и определите переход между состояниями так, чтобы произведение ',
        '8' =>
        ' от шага к шагу не менялось. Вначале значение ',
        '9' =>
        ' берется равным 1, а ответ получается как значение ',
        '10' =>
        ' в момент окончания процесса. ' .
        'В общем случае метод определения инварианта (invariant quantity), который не изменяется при переходе между шагами, является мощным способом размышления о построении итеративных алгоритмов.)',
    ],
];
