<?php

return [
    'title' => 'Умножение с помощью сложения',
    'description' => [
        '1' =>
        "Алгоритмы возведения в степень из этого раздела основаны на повторяющемся умножении. " .
        "Подобным же образом можно производить умножение с помощью повторяющегося сложения. " .
        "Следующая процедура умножения (в которой предполагается, что наш язык способен только складывать, но не умножать) аналогична процедуре ",
        '2' =>
        ":",
        '3' =>
        "Этот алгоритм затрачивает количество шагов, линейно пропорциональное ",
        '4' =>
        ". Предположим теперь, что, наряду со сложением, у нас есть операции ",
        '5' =>
        ", которая удваивает целое число, и ",
        '6' =>
        ", которая делит (четное) число на 2. Используя их, напишите процедуру умножения ",
        '7' =>
        ", аналогичную ",
        '8' =>
        ", которая затрачивает логарифмическое число шагов.",
    ],
];
