<?php

return [
    'title' => 'Числа Фибоначчи через преобразование',
    'description' => [
        '1' =>
        'Существует хитрый алгоритм получения чисел Фибоначчи за логарифмическое число шагов. ' .
        'Вспомните трансформацию переменных состояния ',
        '2' =>
        ' и ',
        '3' =>
        ' процесса ',
        '4' =>
        ' из раздела 1.2.2: ',
        '5' =>
        ' и ',
        '6' =>
        '. Назовем эту трансформацию ',
        '7' =>
        ' и заметим, что n-кратное применение ',
        '8' =>
        ', начиная с 1 и 0, дает нам пару ',
        '9' =>
        ' и ',
        '10' =>
        '. Другими словами, числа Фибоначчи получаются путем применения ',
        '11' =>
        ', n-ой степени трансформации ',
        '12' =>
        ', к паре ',
        '13' =>
        '. Теперь рассмотрим ',
        '14' =>
        ' как частный случай ',
        '15' =>
        ', ',
        '16' =>
        ' в семействе трансформаций ',
        '17' =>
        ', где ',
        '18' =>
        ' преобразует пару ',
        '19' =>
        ' по правилу ',
        '20' =>
        '. Покажите, что двукратное применение трансформации ',
        '21' =>
        ' равносильно однократному применению трансформации ',
        '22' =>
        ' того же типа, и вычислите ',
        '23' =>
        ' и ',
        '24' =>
        ' через ',
        '25' =>
        ' и ',
        '26' =>
        '. Это дает нам прямой способ возводить такие трансформации в квадрат, и таким образом, мы можем вычислить ',
        '27' =>
        ' с помощью последовательного возведения в квадрат, как в процедуре ',
        '28' =>
        '. Используя все эти идеи, завершите следующую процедуру, которая дает результат за логарифмическое число шагов:',
    ],
];
