<?php

return [
    'title' => 'НОД и порядки вычисления',
    'description' => [
        '1' =>
        'Процесс, порождаемый процедурой, разумеется, зависит от того, по каким правилам работает интерпретатор. ' .
        'В качестве примера рассмотрим итеративную процедуру ',
        '2' =>
        ', приведенную выше. Предположим, что мы вычисляем эту процедуру с помощью нормального порядка, описанного в разделе 1.1.5. ' .
        '(Правило нормального порядка вычислений для ',
        '3' =>
        ' описано в упражнении ',
        '4' =>
        '.) Используя подстановочную модель для нормального порядка, проиллюстрируйте процесс, порождаемый при вычислении ',
        '5' =>
        ' и укажите, какие операции вычисления остатка действительно выполняются. Сколько операций ',
        '6' =>
        ' выполняется на самом деле при вычислении ',
        '7' =>
        ' в нормальном порядке? При вычислении в аппликативном порядке?',
    ],
];
