<?php

return [
    'title' => "Медленная процедура",
    'description' => [
        '1' =>
        "У Хьюго Дума большие трудности в упражнении ",
        '2' =>
        ". Процедура ",
        '3' =>
        " у него работает медленнее, чем ",
        '4' =>
        ". Хьюго просит помощи у своей знакомой Евы Лу Атор. Вместе изучая код Хьюго, они обнаруживают, " .
        "что тот переписал процедуру ",
        '5' =>
        " с явным использованием умножения вместо того, чтобы вызывать ",
        '6' =>
        ":",
        '7' =>
        "Хьюго говорит: «Я не вижу здесь никакой разницы». «Зато я вижу, — отвечает Ева. — Переписав процедуру таким образом, " .
        "ты превратил процесс порядка Θ(log n) в процесс порядка Θ(n)». Объясните.",
    ],
];
