<?php

return [
    'title' => 'Числа Кармайкла',
    'description' => [
        '1' =>
        "Покажите, что числа Кармайкла (несколько первых это: 561, 1105, 1729, 2465, 2821 и 6601) действительно «обманывают» тест Ферма: " .
        "напишите процедуру ",
        '2' =>
        ", которая берет целое число ",
        '3' =>
        " и проверяет, правда ли ",
        '4' =>
        " в степени ",
        '5' =>
        " равняется ",
        '6' =>
        " по модулю ",
        '7' =>
        " для всех ",
        '8' =>
        ", и проверьте эту процедуру на этих числах Кармайкла.",
    ],
];
