<?php

return [
    'title' => "Правило Симпсона",
    'description' => [
        '1' =>
        "Правило Симпсона — более точный метод численного интегрирования, чем представленный выше. " .
        "С помощью правила Симпсона интеграл функции ",
        '2' =>
        " между ",
        '3' =>
        " и ",
        '4' =>
        " приближенно вычисляется в виде",
        '5' =>
        "где ",
        '6' =>
        ", для какого - то четного целого числа ",
        '7' =>
        ", а ",
        '8' =>
        ". (Увеличение ",
        '9' =>
        " повышает точность приближенного вычисления.) Определите процедуру ",
        '10' =>
        ", которая принимает в качестве аргументов ",
        '11' =>
        ", ",
        '12' =>
        ", ",
        '13' =>
        " и ",
        '14' =>
        ", и возвращает значение интеграла, вычисленное по правилу Симпсона. С помощью этой процедуры проинтегрируйте ",
        '15' =>
        " между 0 и 1 (с ",
        '16' =>
        " = 100 и ",
        '17' =>
        " = 1000) и сравните результаты с процедурой ",
        '18' =>
        ", приведенной выше.",
    ],
];
