<?php

return [
    'title' => 'Процедуры высших порядков',
    'description' => [
        '1' =>
        "а. Процедура sum — всего лишь простейшая из обширного множества подобных абстракций, которые можно выразить через процедуры высших порядков(52). " .
        "Напишите аналогичную процедуру под названием product, которая вычисляет произведение значений функции в точках на указанном интервале. " .
        "Покажите, как с помощью этой процедуры определить factorial. Кроме того, при помощи product вычислите приближенное значение π по формуле52",
        '2' =>
        "б. Если Ваша процедура product порождает рекурсивный процесс, перепишите ее так, чтобы она порождала итеративный. " .
        "Если она порождает итеративный процесс, перепишите ее так, чтобы она порождала рекурсивный."
    ]
];
