<?php

return [
    'title' => 'Процедуры высших порядков',
    'description' => [
        '1' =>
        "а. Процедура ",
        '2' =>
        " — всего лишь простейшая из обширного множества подобных абстракций, которые можно выразить через процедуры высших порядков. " .
        "Напишите аналогичную процедуру под названием ",
        '3' =>
        ", которая вычисляет произведение значений функции в точках на указанном интервале. Покажите, как с помощью этой процедуры определить ",
        '4' =>
        ". Кроме того, при помощи ",
        '5' =>
        " вычислите приближенное значение ",
        '6' =>
        " по формуле",
        '7' =>
        "б. Если Ваша процедура ",
        '8' =>
        " порождает рекурсивный процесс, перепишите ее так, чтобы она порождала итеративный. " .
        "Если она порождает итеративный процесс, перепишите ее так, чтобы она порождала рекурсивный.",
    ],
];
