<?php

return [
    'title' => 'Накопление',
    'description' => [
        '1' =>
        "а. Покажите, что ",
        '2' =>
        " и ",
        '3' =>
        " (упражнение ",
        '4' =>
        ") являются частными случаями еще более общего понятия, называемого накопление (accumulation), " .
        "которое комбинирует множество термов с помощью некоторой общей функции накопления",
        '5' =>
        " принимает в качестве аргументов те же описания термов и диапазона, что и ",
        '6' =>
        " с ",
        '7' =>
        ", а еще процедуру ",
        '8' =>
        " (двух аргументов), которая указывает, как нужно присоединить текущий терм к результату накопления предыдущих, и ",
        '9' =>
        ", базовое значение, которое нужно использовать, когда термы закончатся. Напишите ",
        '10' =>
        " и покажите, как и ",
        '11' =>
        ", и ",
        '12' =>
        " можно определить в виде простых вызовов ",
        '13' =>
        ".",
        '14' =>
        "б. Если Ваша процедура ",
        '15' =>
        " порождает рекурсивный процесс, перепишите ее так, чтобы она порождала итеративный. " .
        "Если она порождает итеративный процесс, перепишите ее так, чтобы она порождала рекурсивный.",
    ],
];
