<?php

return [
    'title' => 'Обобщенное накопление',
    'description' => [
        '1' =>
        "Можно получить еще более общую версию ",
        '2' =>
        " (упражнение ",
        '3' =>
        "), если ввести понятие фильтра (filter) на комбинируемые термы." .
        "То есть комбинировать только те термы, порожденные из значений диапазона, которые удовлетворяют указанному условию. " .
        "Получающаяся абстракция ",
        '4' =>
        " получает те же аргументы, что и ",
        '5' =>
        ", плюс дополнительный одноаргументный предикат, который определяет фильтр. Запишите ",
        '6' =>
        " ввиде процедуры. Покажите, как с помощью ",
        '7' =>
        " выразить следующее:",
        '8' =>
        "а. сумму квадратов простых чисел в интервале от ",
        '9' =>
        " до ",
        '10' =>
        " (в предположении, что процедура ",
        '11' =>
        " уже написана);",
        '12' =>
        "б. произведение всех положительных целых чисел меньше ",
        '13' =>
        ", которые просты по отношению к ",
        '14' =>
        " (то есть всех таких положительных целых чисел ",
        '15' =>
        ", что НОД",
        '16' =>
        ").",
    ],
];
