<?php

return [
    'title' => 'Поиск неподвижной точки',
    'description' => [
        '1' =>
        "Измените процедуру ",
        '2' =>
        " так, чтобы она печатала последовательность приближений, которые порождает, с помощью примитивов ",
        '3' =>
        " и ",
        '4' =>
        ", показанных в упражнении ",
        '5' =>
        ". Затем найдите решение уравнения ",
        '6' =>
        " путем поиска неподвижной точки ",
        '7' =>
        ". (Используйте встроенную процедуру Scheme ",
        '8' =>
        ", которая вычисляет натуральные логарифмы.) " .
        "Посчитайте, сколько шагов это занимает при использовании торможения усреднением и без него. " .
        "(Учтите, что нельзя начинать ",
        '9' =>
        " со значения 1, поскольку это вызовет деление на ",
        '10' =>
        ".)",
    ],
];
