<?php

return [
    'title' => 'Конечная цепная дробь',
    'description' => [
        '1' =>
        "а. Бесконечная цепная дробь (continued fraction) есть выражение вида",
        '2' =>
        "В качестве примера можно показать, что расширение бесконечной цепной дроби при всех ",
        '3' =>
        " и ",
        '4' =>
        ", равных 1, дает ",
        '5' =>
        ", где ",
        '6' =>
        " — золотое сечение (описанное в разделе 1.2.2). Один из способов вычислить цепную дробь состоит в том, " .
        "чтобы после заданного количества термов оборвать вычисление. " .
        "Такой обрыв — так называемая конечная цепная дробь (finite continued fraction) из ",
        '7' =>
        " элементов, — имеет вид",
        '8' =>
        "Предположим, что ",
        '9' =>
        " и ",
        '10' =>
        " — процедуры одного аргумента (номера элемента ",
        '11' =>
        "), возвращающие ",
        '12' =>
        " и ",
        '13' =>
        " элементов цепной дроби. Определите процедуру ",
        '14' =>
        " так, чтобы вычисление ",
        '15' =>
        " давало значение ",
        '16' =>
        "-элементной конечной цепной дроби. Проверьте свою процедуру, вычисляя приближения к ",
        '17' =>
        " с помощью",
        '18' =>
        "для последовательных значений ",
        '19' =>
        ". Насколько большим пришлось сделать ",
        '20' =>
        ", чтобы получить приближение, верное с точностью 4 цифры после запятой?",
        '21' =>
        "б. Если Ваша процедура ",
        '22' =>
        " порождает рекурсивный процесс, напишите вариант, который порождает итеративный процесс. " .
        "Если она порождает итеративный процесс, напишите вариант, порождающий рекурсивный процесс.",
    ],
];
