<?php

return [
    'title' => 'Формула Эйлера',
    'description' => [
        '1' =>
        "В 1737 году швейцарский математик Леонард Эйлер опубликовал статью De functionibus Continuis, которая содержала расширение цепной дроби для ",
        '2' =>
        ", где ",
        '3' =>
        " — основание натуральных логарифмов. В этой дроби все ",
        '4' =>
        " равны ",
        '5' =>
        ", а ",
        '6' =>
        " последовательно равны ",
        '7' =>
        " Напишите программу, использующую Вашу процедуру ",
        '8' =>
        " из упражнения ",
        '9' =>
        " для вычисления ",
        '10' =>
        " на основании формулы Эйлера.",
    ],
];
