<?php

return [
    'title' => "Формула Ламберта",
    'description' => [
        '1' =>
        "Представление тангенса в виде цепной дроби было опубликовано в 1770 году немецким математиком Й.Х. Ламбертом:",
        '2' =>
        "где ",
        '3' =>
        " дан в радианах. Определите процедуру ",
        '4' =>
        ", которая вычисляет приближение к тангенсу на основе формулы Ламберта. ",
        '5' =>
        " указывает количество термов, которые требуется вычислить, как в упражнении ",
        '6' =>
        ".",
    ],
];
