<?php

return [
    'title' => 'Удваивание',
    'description' => [
        '1' =>
        "Определите процедуру ",
        '2' =>
        ", которая принимает как аргумент процедуру с одним аргументом и возвращает процедуру, " .
        "которая применяет исходную процедуру дважды. Например, если процедура ",
        '3' =>
        " добавляет к своему аргументу ",
        '4' =>
        ", то ",
        '5' =>
        " должна быть процедурой, которая добавляет ",
        '6' =>
        ". Скажите, какое значение возвращает",
    ],
];
