<?php

return [
    'title' => 'Композиция',
    'description' => [
        '1' =>
        "Пусть ",
        '2' =>
        " и ",
        '3' =>
        " — две одноаргументные функции. По определению,композиция (composition) ",
        '4' =>
        " и ",
        '5' =>
        " есть функция ",
        '6' =>
        ". Определите процедуру ",
        '7' =>
        " которая реализует композицию. Например, если ",
        '8' =>
        " — процедура, добавляющая к своему аргументу ",
        '9' =>
        ".",
    ],
];
