<?php

return [
    'title' => 'N-кратное применение f',
    'description' => [
        '1' =>
        "Если ",
        '2' =>
        " есть численная функция, а ",
        '3' =>
        " — положительное целое число, то мы можем построить ",
        '4' =>
        "-кратное применение ",
        '5' =>
        ", которое определяется как функция, значение которой в точке ",
        '6' =>
        " равно ",
        '7' =>
        ". Например, если ",
        '8' =>
        " есть функция ",
        '9' =>
        ", то ",
        '10' =>
        "-кратным применением ",
        '11' =>
        " будет функция ",
        '12' =>
        ". Если ",
        '13' =>
        " есть операция возведения в квадрат, то ",
        '14' =>
        "-кратное применение ",
        '15' =>
        " есть функция, которая возводит свой аргумент в ",
        '16' =>
        "-ю степень. Напишите процедуру, которая принимает в качестве ввода процедуру, вычисляющую ",
        '17' =>
        ", и положительное целое ",
        '18' =>
        ", и возвращает процедуру, вычисляющую ",
        '19' =>
        "-кратное применение ",
        '20' =>
        ". Требуется, чтобы Вашу процедуру можно было использовать в таких контекстах:",
        '21' =>
        "Подсказка: может оказаться удобно использовать ",
        '22' =>
        " из упражнения ",
        '23' =>
        ".",
    ],
];
