<?php

return [
    'title' => 'N-кратно сглаженная функция',
    'description' => [
        '1' =>
        "Идея сглаживания (smoothing a function) играет важную роль в обработке сигналов. Если ",
        '2' =>
        " — функция, а ",
        '3' =>
        " — некоторое малое число, то сглаженная версия ",
        '4' =>
        " есть функция, значение которой в точке ",
        '5' =>
        " есть среднее между ",
        '6' =>
        ", ",
        '7' =>
        " и ",
        '8' =>
        ". Напишите процедуру ",
        '9' =>
        ", которая в качестве ввода принимает процедуру, вычисляющую ",
        '10' =>
        ", и возвращает процедуру, вычисляющую сглаженную версию ",
        '11' =>
        ". Иногда бывает удобно проводить повторное сглаживание (то есть сглаживать сглаженную функцию и т.д.), получая ",
        '12' =>
        "-кратно сглаженную функцию (n-fold smoothed function). Покажите, как породить ",
        '13' =>
        "-кратно сглаженную функцию с помощью ",
        '14' =>
        " и ",
        '15' =>
        " из упражнения ",
        '16' =>
        ".",
    ],
];
