<?php

return [
    'title' => 'Пошаговое улучшение',
    'description' => [
        '1' =>
        "Некоторые из вычислительных методов, описанных в этой главе, являются примерами чрезвычайно общей вычислительной стратегии, " .
        "называемой пошаговое улучшение (iterative improvement). Пошаговое улучшение состоит в следующем: чтобы что-то вычислить, " .
        "нужно взять какое-то начальное значение, проверить, достаточно ли оно хорошо, чтобы служить ответом, и если нет, " .
        "то улучшить это значение и продолжить процесс с новым значением. Напишите процедуру ",
        '2' =>
        ", которая принимает в качестве аргументов две процедуры: проверку, достаточно ли хорошо значение, и метод улучшения значения. ",
        '3' =>
        " должна возвращать процедуру, которая принимает начальное значение в качестве аргумента и улучшает его, пока оно не станет достаточно хорошим. Перепишите процедуру ",
        '4' =>
        " из раздела 1.1.7 и процедуру ",
        '5' =>
        " из раздела 1.3.3 в терминах ",
        '6' =>
        ".",
    ],
];
