<?php

return [
    'description' => [
        '1' =>
            'Бен Битобор придумал тест для проверки интерпретатора на то, ' .
            'с каким порядком вычислений онработает, аппликативным или нормальным. ' .
            'Бен определяет такие две процедуры:',
        '2' =>
            'Затем он вычисляет выражение',
        '3' =>
            'Какое поведение увидит Бен, если интерпретатор использует аппликативный порядок вычислений? ' .
            'Какое поведение он увидит, если интерпретатор использует нормальный порядок? Объясните Ваш ответ. ' .
            '(Предполагается, что правило вычисления особой формы if одинаково независимо от того,какой порядок вычислений используется. ' .
            'Сначала вычисляется выражение-предикат, и результат определяет, нужно ли вычислять выражение-следствие или альтернативу.)',
    ]
];
