<?php

return [
    'title' => 'Особая форма',
    'description' => [
        '1' =>
        "Лиза П. Хакер не понимает, почему if должна быть особой формой.".
        "«Почему нельзя просто определить ее как обычную процедуру с помощью cond?»".
        " — спрашивает она. Лизина подруга Ева Лу Атор утверждает, что, разумеется, можно, и определяет новую версию if:",
        '2' => 
        "Ева показывает Лизе новую программу:",
        '3' =>
        "Обрадованная Лиза переписывает через new-if программу вычисления квадратного корня:",
        '4' =>
        "Что получится, когда Лиза попытается использовать эту процедуру для вычисления квадратных корней? Объясните."
    ]
];