<?php

return [
    'title' => 'Процедуры сложения',
    'description' => [
        '1' =>
        "Каждая из следующих двух процедур определяет способ сложения двух положительных целых чисел с помощью процедур inc, " .
        "которая добавляет к своему аргументу 1, и dec, которая отнимает от своего аргумента 1.",
        '2' =>
        "Используя подстановочную модель, проиллюстрируйте процесс, порождаемый каждой из этих процедур, вычислив (+ 4 5). " .
        "Являются ли эти процессы итеративными или рекурсивными?",
    ],
];
