<?php

return [
    'title' => 'Различные результаты по формулам для параллельных резисторов',
    'description' => [
        '1' =>
        "Покажите, что Дайко прав. Исследуйте поведение системы на различных арифметических выражениях. Создайте несколько интервалов ",
        '2' =>
        " и ",
        '3' =>
        " и вычислите с их помощью выражения ",
        '4' =>
        " и ",
        '5' =>
        ". Наибольшую пользу Вы получите, если будете использовать интервалы, радиус которых составляет малую часть от среднего значения. " .
        "Исследуйте результаты вычислений в форме центр/проценты (см. упражнение ",
        '6' =>
        ").",
    ],
];
