<?php

return [
    'title' => 'Размен монет разных валют',
    'description' => [
        '1' =>
        "Рассмотрим программу подсчета способов размена из раздела 1.2.2. " .
        "Было бы приятно иметь возможность легко изменять валюту, которую эта программа использует, так, чтобы можно было, например, вычислить, сколькими способами можно разменять британский фунт. " .
        "Эта программа написана так, что знание о валюте распределено между процедурами ",
        '2' =>
        " и ",
        '3' =>
        " (которая знает, что существует пять видов американских монет). Приятнее было бы иметь возможность просто задавать список монет, которые можно использовать при размене. ",
        '4' =>
        "Мы хотим переписать процедуру ",
        '5' =>
        " так, чтобы ее вторым аргументом был список монет, а не целое число, которое указывает, какие монеты использовать. " .
        "Тогда у нас могли бы быть списки, определяющие типы валют:",
        '6' =>
        "Можно было бы вызывать ",
        '7' =>
        " следующим образом:",
        '8' =>
        "Это потребует некоторых изменений в программе ",
        '9' =>
        ". Ее форма останется прежней, но со вторым аргументом она будет работать иначе, вот так:",
        '10' =>
        "Определите процедуры ",
        '11' =>
        ", ",
        '12' =>
        " и ",
        '13' =>
        " в терминах элементарных операций над списковыми структурами. Влияет ли порядок списка ",
        '14' =>
        " на результат, получаемый ",
        '15' =>
        "? Почему?",
    ],
];
