<?php

return [
    'title' => 'Представление отрезков на плоскости',
    'description' => [
        '1' =>
        'Рассмотрим задачу представления отрезков прямой на плоскости. Каждый отрезок представляется как пара точек: начало и конец. Определите конструктор ',
        '2' =>
        ' и селекторы ',
        '3' =>
        ' и ',
        '4' =>
        ', которые определяют представление отрезков в терминах точек. Далее, точку можно представить как пару чисел: координата ',
        '5' =>
        ' и координата ',
        '6' =>
        '. Соответственно, напишите конструктор ',
        '7' =>
        ' и селекторы ',
        '8' =>
        ' и ',
        '9' =>
        ', которые определяют такое представление. Наконец, используя свои селекторы и конструктор, напишите процедуру ',
        '10' =>
        ', которая принимает отрезок в качестве аргумента и возвращает его середину (точку, координаты которой являются средним координат концов отрезка). ' .
        'Чтобы опробовать эти процедуры, Вам потребуется способ печатать координаты точек:',
    ],
];
