<?php

return [
    'title' => 'Square-list с итеративным процессом',
    'description' => [
        '1' =>
        "Хьюго Дум пытается переписать первую из процедур ",
        '2' =>
        " из упражнения ",
        '3' =>
        " так, чтобы она работала как итеративный процесс:",
        '4' =>
        "К сожалению, такое определение ",
        '5' =>
        " выдает список результатов в порядке, обратном желаемому. Почему?",
        '6' =>
        "Затем Хьюго пытается исправить ошибку, обменяв аргументы ",
        '7' =>
        ":",
        '8' =>
        "И так программа тоже не работает. Объясните это.",
    ],
];
