<?php

return [
    'title' => 'Square-list с итеративным процессом',
    'description' => [
        '1' =>
        "Хьюго Дум пытается переписать первую из процедур square-list из упражнения ",
        '2' =>
        " так, чтобы она работала как итеративный процесс:",
        '3' =>
        "К сожалению, такое определение square-list выдает список результатов в порядке, обратном желаемому. Почему?",
        '4' =>
        "Затем Хьюго пытается исправить ошибку, обменяв аргументы cons",
        '5' =>
        "И так программа тоже не работает. Объясните это.",
    ],
];
