<?php

return [
    'title' => 'Процедура for-each',
    'description' => [
        '1' =>
        "Процедура ",
        '2' =>
        " похожа на ",
        '3' =>
        ". В качестве аргументов она принимает процедуру и список элементов. Однако вместо того, чтобы формировать список результатов, ",
        '4' =>
        " просто применяет процедуру по очереди ко всем элементам слева направо. Результаты применения процедуры к аргументам не используются вообще — ",
        '5' =>
        " применяют к процедурам, которые осуществляют какое-либо действие вроде печати. Например,",
        '6' =>
        "Значение, возвращаемое вызовом ",
        '7' =>
        " (оно в листинге не показано) может быть каким угодно, например истина. Напишите реализацию ",
        '8' =>
        ".",
    ],
];
