<?php

return [
    'title' => 'Дерево квадратов',
    'description' => [
        '1' =>
        "Определите процедуру ",
        '2' =>
        ", подобную процедуре ",
        '3' =>
        " из упражнения ",
        '4' =>
        ". А именно, ",
        '5' =>
        " должна вести себя следующим образом:",
        '6' =>
        "Определите ",
        '7' =>
        " как прямо (то есть без использования процедур высших порядков), так и с помощью ",
        '8' =>
        " и рекурсии.",
    ],
];
