<?php

return [
    'title' => "Схема Горнера",
    'description' => [
        '1' =>
        "Вычисление многочлена с переменной ",
        '2' =>
        " при данном значении ",
        '3' =>
        " можно сформулировать в виде накопления. Мы вычисляем многочлен",
        '4' =>
        "по известному алгоритму, называемому схема Горнера (Horner’s rule), которое переписывает формулу в виде",
        '5' =>
        "Другими словами, мы начинаем с ",
        '6' =>
        ", умножаем его на ",
        '7' =>
        ", и так далее, пока не достигнем ",
        '8' =>
        ". Заполните пропуски в следующей заготовке так, чтобы получить процедуру, которая вычисляет многочлены по схеме Горнера. " .
        "Предполагается, что коэффициенты многочлена представлены в виде последовательности, от ",
        '9' =>
        " до ",
        '10' =>
        ".",
        '11' =>
        "Например, чтобы вычислить ",
        '12' =>
        " в точке ",
        '13' =>
        ", нужно ввести",
    ],
];
