<?php

return [
    'title' => 'Процедура accumulate-n',
    'description' => [
        '1' =>
        "Процедура ",
        '2' =>
        " подобна ",
        '3' =>
        ", только свой третий аргумент она воспринимает как последовательность последовательностей, причем предполагается, что все они содержат одинаковое количество элементов. " .
        "Она применяет указанную процедуру накопления ко всем первым элементам последовательностей, вторым элементам последовательностей и так далее, и возвращает последовательность результатов. " .
        "Например, если ",
        '4' =>
        " есть последовательность, состоящая из четырех последовательностей, ",
        '5' =>
        ", то значением ",
        '6' =>
        " будет последовательность ",
        '7' =>
        ". Заполните пробелы в следующем определении ",
        '8' =>
        ":",
    ],
];
