<?php

return [
    'title' => "Матричные операции",
    'description' => [
        '1' =>
        "Предположим, что мы представляем векторы ",
        '2' =>
        " как последовательности чисел, а матрицы ",
        '3' =>
        " как последовательности векторов (рядов матрицы). Например, матрица",
        '4' =>
        "представляется в виде последовательности ",
        '5' =>
        ". Имея такое представление, мы можем использовать операции над последовательностями, чтобы кратко выразить основные действия над матрицами и векторами. " .
        "Эти операции (описанные в любой книге по матричной алгебре) следующие:",
        '6' =>
        " возвращает сумму ",
        '7' =>
        " возвращает вектор ",
        '8' =>
        ", где ",
        '9' =>
        " возвращает матрицу ",
        '10' =>
        ", где ",
        '11' =>
        " возвращает матрицу ",
        '12' =>
        ", где ",
        '13' =>
        "Скалярное произведение мы можем определить так:",
        '14' =>
        "Заполните пропуски в следующих процедурах для вычисления остальных матричных операций. (Процедура ",
        '15' =>
        " описана в упражнении ",
        '16' =>
        ".)",
    ],
];
