<?php

return [
    'title' => "Свёртки",
    'description' => [
        '1' =>
        "Процедура accumulate известна также как fold-right (правая свертка), поскольку она комбинирует первый элемент последовательности с результатом комбинирования всех элементов справа от него. " .
        "Существует также процедура fold-left (левая свертка), которая подобна fold-right, но комбинирует элементы в противоположном направлении:",
        '2' =>
        "Каковы значения следующих выражений?",
        '3' =>
        "Укажите свойство, которому должна удовлетворять op, чтобы для любой последовательности fold-right и fold-left давали одинаковые результаты."
    ]
];
