<?php

return [
    'title' => "Свёртки",
    'description' => [
        '1' =>
        "Процедура accumulate известна также как ",
        '2' =>
        " (правая свертка), поскольку она комбинирует первый элемент последовательности с результатом комбинирования всех элементов справа от него. Существует также процедура ",
        '3' =>
        " (левая свертка), которая подобна ",
        '4' =>
        ", но комбинирует элементы в противоположном направлении:",
        '5' =>
        "Каковы значения следующих выражений?",
        '6' =>
        "Укажите свойство, которому должна удовлетворять ",
        '7' =>
        ", чтобы для любой последовательности ",
        '8' =>
        " и ",
        '9' =>
        " давали одинаковые результаты.",
    ],
];
