<?php

return [
    'title' => 'Процедурное представление пар',
    'description' => [
        '1' =>
        "Вот еще одно процедурное представление для пар. Проверьте для этого представления, что ",
        '2' =>
        " возвращает ",
        '3' =>
        " при любых двух объектах ",
        '4' =>
        " и ",
        '5' =>
        ".",
        '6' =>
        "Каково соответствующее определение ",
        '7' =>
        "? (Подсказка: Чтобы проверить, что это работает, используйте подстановочную модель из раздела 1.1.5.)",
    ],
];
