<?php

return [
    'title' => "Оптимизация queens",
    'description' => [
        '1' =>
        "У Хьюго Дума ужасные трудности при решении упражнения ",
        '2' =>
        ". Его процедура queens вроде бы работает, но невероятно медленно. " .
        "(Хьюго ни разу не удается дождаться, пока она решит хотя бы задачу 6 × 6.) " .
        "Когда Хьюго просит о помощи Еву Лу Атор, она указывает, что он поменял местами порядок вложенных отображений в вызове процедуры flatmap, записав его в виде",
        '3' =>
        "Объясните, почему из-за такой перестановки программа работает медленно. " .
        "Оцените, насколько долго программа Хьюго будет решать задачу с восемью ферзями, если предположить, что программа, приведенная в упражнении ",
        '4' =>
        ", решает ее за время T.",
    ],
];
