<?php

return [
    'title' => 'Представление векторов',
    'description' => [
        '1' =>
        "Двумерный вектор ",
        '2' =>
        ", идущий от начала координат к точке, можно представить в виде пары, состоящей из ",
        '3' =>
        "-координаты и ",
        '4' =>
        "-координаты. Реализуйте абстракцию данных для векторов, написав конструктор ",
        '5' =>
        " и соответствующие селекторы ",
        '6' =>
        " и ",
        '7' =>
        ". В терминах своих селекторов и конструктора реализуйте процедуры ",
        '8' =>
        ", ",
        '9' =>
        " и ",
        '10' =>
        ", которые выполняют операции сложения, вычитания векторов и умножения вектора на скаляр:",
    ],
];
