<?php

return [
    'title' => 'Представление векторов',
    'description' =>
        "Двумерный вектор v, идущий от начала координат к точке, можно представить в виде пары, состоящей из x-координаты и y-координаты. " .
        "Реализуйте абстракцию данных для векторов, написав конструктор make-vect и соответствующие селекторы xcor-vect и ycor-vect. " .
        "В терминах своих селекторов и конструктора реализуйте процедуры add-vect, sub-vect и scale-vect, которые выполняют операции сложения, вычитания векторов и умножения вектора на скаляр:",
];
