<?php

return [
    'title' => 'Представление отрезков с помощью векторов.',
    'description' => [
        '1' =>
        "Направленный отрезок на плоскости можно представить в виде пары векторов: вектор от начала координат до начала отрезка и вектор от начала координат до конца отрезка. " .
        "Используйте свое представление векторов из упражнения ",
        '2' =>
        " и определите представление отрезков с конструктором ",
        '3' =>
        " и селекторами ",
        '4' =>
        " и ",
        '5' =>
        ".",
    ],
];
