<?php

return [
    'title' => "Определение элементарных рисовалок",
    'description' => [
        '1' =>
        "С помощью ",
        '2' =>
        " определите следующие элементарные рисовалки:",
        '3' =>
        "а. Рисовалку, которая обводит указанную рамку",
        '4' =>
        "б. Рисовалку, которая рисует «Х», соединяя противоположные концы рамки.",
        '5' =>
        "в. Рисовалку, которая рисует ромб, соединяя между собой середины сторон рамки.",
        '6' =>
        "г. Рисовалку ",
        '7' =>
        ".",
    ],
];
