<?php

return [
    'title' => "Определение элементарных рисовалок",
    'description' => [
        '1' =>
        "С помощью segments->painter определите следующие элементарные рисовалки:",
        '2' =>
        "а. Рисовалку, которая обводит указанную рамку",
        '3' =>
        "б. Рисовалку, которая рисует «Х», соединяя противоположные концы рамки.",
        '4' =>
        "в. Рисовалку, которая рисует ромб, соединяя между собой середины сторон рамки.",
        '5' =>
        "г. Рисовалку wave.",
    ],
];
