<?php

return [
    'title' => 'Представление пар с помощью чисел и арифметических операций',
    'description' => [
        '1' =>
        "Покажите, что можно представлять пары неотрицательных целых чисел, используя только числа и арифметические операции, если представлять пару ",
        '2' =>
        " и ",
        '3' =>
        " как произведение ",
        '4' =>
        ". Дайте соответствующие определения процедур ",
        '5' =>
        ", ",
        '6' =>
        " и ",
        '7' =>
        ".",
    ],
];
