<?php

return [
    'title' => 'Процедура below',
    'description' => [
        '1' =>
        "Определите для рисовалок операцию ",
        '2' =>
        ". ",
        '3' =>
        " принимает в качестве аргументов две рисовалки. " .
        "Когда получившейся рисовалке передается рамка, она рисует в нижней ее половине при помощи первой рисовалки, а в верхней при помощи второй. Определите ",
        '4' =>
        " двумя способами — один раз аналогично процедуре ",
        '5' =>
        ", как она приведена выше, а второй раз через ",
        '6' =>
        " и операции вращения (см. упражнение ",
        '7' =>
        ").",
    ],
];
