<?php

return [
    'title' => "Изменение рисовалки wave",
    'description' => [
        '1' =>
        "Измените предел квадрата рисовалки ",
        '2' =>
        ", показанный на рисунке 2.9, работая на каждом из вышеописанных уровней. А именно:",
        '3' =>
        "а. Добавьте новые отрезки к элементарной рисовалке ",
        '4' =>
        " из упражнения ",
        '5' =>
        " (например, изобразив улыбку).",
        '6' =>
        "б. Измените шаблон, который порождает ",
        '7' =>
        " (например, используя только одну копию образов ",
        '8' =>
        " и ",
        '9' =>
        " вместо двух).",
        '10' =>
        "в. Измените версию ",
        '11' =>
        ", использующую ",
        '12' =>
        ", так, чтобы углы компоновались как-нибудь по-другому. (Например, можно сделать так, чтобы большой мистер Роджерс выглядывал из каждого угла квадрата.)",
        '13' =>
        "Рис. 2.9. Узоры, порождаемые языком описания изображений.",
    ],
];
