<?php

return [
    'title' => "Изменение рисовалки wave",
    'description' => [
        '1' =>
        "Измените предел квадрата рисовалки wave, показанный на рисунке 2.9, работая на каждом из вышеописанных уровней. А именно:",
        '2' =>
        "а. Добавьте новые отрезки к элементарной рисовалке wave из упражнения 2.49 (например, изобразив улыбку).",
        '3' =>
        "б. Измените шаблон, который порождает corner-split (например, используя только одну копию образов up-split и right-split вместо двух).",
        '4' =>
        "в. Измените версию square-limit, использующую square-of-four, так, чтобы углы компоновались как-нибудь по-другому. (Например, можно сделать так, чтобы большой мистер Роджерс выглядывал из каждого угла квадрата.)",
    ],
];
