<?php

return [
    'title' => "Equal? в виде процедуры",
    'description' => [
        '1' =>
        "Предикат ",
        '2' =>
        " для двух списков возвращает истину, если они содержат одни и те же элементы в одинаковом порядке. Например,",
        '3' =>
        "истинно, но",
        '4' =>
        "ложно. Более точно, можно определить ",
        '5' =>
        " рекурсивно в терминах базового равенства символов ",
        '6' =>
        ", сказав, что ",
        '7' =>
        " равно ",
        '8' =>
        ", если оба они символы и для них выполняется ",
        '9' =>
        " либо оба они списки и при этом верно, что ",
        '10' =>
        " равняется в смысле ",
        '11' =>
        ", а ",
        '12' =>
        " равняется в смысле ",
        '13' =>
        ". Пользуясь этой идеей, напишите ",
        '14' =>
        " в виде процедуры ",
        '15' =>
        ".",
    ],
];
