<?php

return [
    'title' => "Простейшее дифференцирование",
    'description' => [
        '1' =>
        "Покажите, как расширить простейшую программу дифференцирования так, чтобы она воспринимала больше разных типов выражений. Например, реализуйте правило взятия производной",
        '2' =>
        "добавив еще одну проверку к программе ",
        '3' =>
        " и определив соответствующие процедуры ",
        '4' =>
        ", ",
        '5' =>
        ", ",
        '6' =>
        " и ",
        '7' =>
        " (обозначать возведение в степень можно символом ",
        '8' =>
        "). Встройте правила, что любое выражение, возведенное в степень ",
        '9' =>
        ", дает ",
        '10' =>
        ", а возведенное в степень ",
        '11' =>
        " равно самому себе.",
    ],
];
