<?php

return [
    'title' => "Дифференцирование нескольких термов",
    'description' => [
        '1' =>
        "Расширьте программу дифференцирования так, чтобы она работала с суммами и произведениями любого (больше двух) количества термов. Тогда последний из приведенных выше примеров мог бы быть записан как",
        '2' =>
        "Попытайтесь сделать это, изменяя только представление сумм и произведений, не трогая процедуру ",
        '3' =>
        ". Тогда, например, процедура ",
        '4' =>
        " будет возвращать первое слагаемое суммы, а ",
        '5' =>
        " сумму остальных.",
    ],
];
