<?php

return [
    'title' => 'Числа Чёрча',
    'description' => [
        '1' =>
        "Если представление пар как процедур было для Вас еще недостаточно сумасшедшим, то заметьте, что в языке, который способен манипулировать процедурами, мы можем обойтись и без чисел (по крайней мере, пока речь идет о неотрицательных числах), определив ",
        '2' =>
        " и операцию прибавления ",
        '3' =>
        " так:",
        '4' =>
        "Такое представление известно как числа Чёрча (Church numerals), по имени его изобретателя, Алонсо Чёрча, того самого логика, который придумал λ-исчисление.",
        '5' =>
        "Определите ",
        '6' =>
        " (единицу) и ",
        '7' =>
        " (двойку) напрямую (не через ",
        '8' =>
        " и ",
        '9' =>
        "). (Подсказка: вычислите ",
        '10' =>
        " с помощью подстановки.) Дайте прямое определение процедуры сложения + (",
        '11' =>
        ") (не в терминах повторяющегося применения ",
        '12' =>
        ").",
    ],
];
