<?php

return [
    'title' => 'Множество как список с повторяющимися элементами',
    'description' => [
        '1' =>
        "Мы указали, что множество представляется как список без повторяющихся элементов. Допустим теперь, что мы разрешаем повторяющиеся элементы. Например, множество ",
        '2' =>
        " могло бы быть представлено как список ",
        '3' =>
        ". Разработайте процедуры ",
        '4' =>
        ", ",
        '5' =>
        ", ",
        '6' =>
        " и ",
        '7' =>
        ", которые бы работали с таким представлением. Как соотносится эффективность этих операций с эффективностью соответствующих процедур для представления без повторений? " .
        "Существуют ли приложения, в которых Вы бы использовали скорее это представление, чем представление без повторений?",
    ],
];
