<?php

return [
    'title' => "Преобразование дерева в список",
    'description' => [
        '1' =>
        "Каждая из следующих двух процедур преобразует дерево в список.",
        '2' =>
        "а. Для всякого ли дерева эти процедуры дают одинаковый результат? Если нет, то как их результаты различаются? Какой результат дают эти две процедуры для деревьев с рисунка 2.16?",
        '3' =>
        "б. Одинаков ли порядок роста этих процедур по отношению к числу шагов, требуемых для преобразования сбалансированного дерева с n элементами в список? Если нет, которая из них растет медленнее?",
    ],
];
