<?php

return [
    'title' => "Процедура partial-tree",
    'description' => [
        '1' =>
        "Следующая процедура ",
        '2' =>
        " преобразует упорядоченный список в сбалансированное бинарное дерево. Вспомогательная процедура ",
        '3' =>
        " принимает в качестве аргументов целое число ",
        '4' =>
        " и список по крайней мере из ",
        '5' =>
        " элементов, и строит сбалансированное дерево из первых ",
        '6' =>
        " элементов дерева. Результат, который возвращает ",
        '7' =>
        ", — это пара (построенная через ",
        '8' =>
        "), ",
        '9' =>
        " которой есть построенное дерево, а ",
        '10' =>
        " — список элементов, не включенных в дерево.",
        '11' =>
        "а. Дайте краткое описание, как можно более ясно объясняющее работу ",
        '12' =>
        ". Нарисуйте дерево, которое ",
        '13' =>
        " строит из списка ",
        '14' =>
        "б. Каков порядок роста по отношению к числу шагов, которые требуются процедуре ",
        '15' =>
        " для преобразования дерева из ",
        '16' =>
        " элементов?",
    ],
];
