<?php

return [
    'title' => "Процедура encode-symbol",
    'description' => [
        '1' =>
        "Процедура ",
        '2' =>
        " получает в качестве аргументов сообщение и дерево, и порождает список битов, который представляет закодированное сообщение.",
        '3' =>
        " — процедура, которую Вы должны написать, возвращает список битов, который кодирует данный символ в соответствии с заданным деревом. " .
        "Вы должны спроектировать ",
        '4' =>
        " так, чтобы она сообщала об ошибке, если символ вообще не содержится в дереве. " .
        "Проверьте свою процедуру, закодировав тот результат, который Вы получили в упражнении ",
        '5' =>
        ", с деревом-примером и проверив, совпадает ли то, что получаете Вы, с исходным сообщением.",
    ],
];
