<?php

return [
    'title' => "Кодирование сообщения",
    'description' => [
        '1' =>
        "Нижеприведенный алфавит из восьми символов с соответствующими им относительными частотами был разработан, чтобы эффективно кодировать слова рок-песен 1950-х годов. (Обратите внимание, что «символы» «алфавита» не обязаны быть отдельными буквами.)",
        '2' =>
        "При помощи ",
        '3' =>
        " (упр. ",
        '4' =>
        ") породите соответствующее дерево Хаффмана, и с помощью ",
        '5' =>
        " (упр. ",
        '6' =>
        ") закодируйте следующее сообщение:",
        '7' =>
        "Сколько битов потребовалось для кодирования? Каково наименьшее число битов, которое потребовалось бы для кодирования этой песни, если использовать код с фиксированной длиной для алфавита из восьми символов?",
    ],
];
