<?php

return [
    'title' => 'Частоты символов',
    'description' => [
        '1' =>
        "Допустим, у нас есть дерево Хаффмана для алфавита из ",
        '2' =>
        " символов, и относительные частоты символов равны ",
        '3' =>
        ". Изобразите дерево для ",
        '4' =>
        "; для ",
        '5' =>
        ". Сколько битов в таком дереве (для произвольного ",
        '6' =>
        ") требуется, чтобы закодировать самый частый символ? Самый редкий символ?",
    ],
];
