<?php

return [
    'title' => "Селекторы комплексных чисел",
    'description' => [
        '1' =>
        "Хьюго Дум пытается вычислить выражение ",
        '2' =>
        ", где ",
        '3' =>
        " — объект, показанный на рис. 2.24. К своему удивлению, вместо ответа ",
        '4' =>
        " он получает сообщение об ошибке от ",
        '5' =>
        ", гласящее, что у операции ",
        '6' =>
        " нет методов для типа ",
        '7' =>
        ". Он показывает результат Лизе П. Хакер. Та заявляет: ''Дело в том, что селекторы комплексных чисел для чисел с меткой ",
        '8' =>
        " определены не были, а были только для чисел с меткой ",
        '9' =>
        " и ",
        '10' =>
        ". Все, что требуется, чтобы заставить это работать — это добавить к пакету ",
        '11' =>
        " следующее:''",
        '12' =>
        "Подробно опишите, почему это работает. В качестве примера, проследите все процедуры, которые вызываются при вычислении ",
        '13' =>
        ", где ",
        '14' =>
        " — объект, показанный на рис. 2.24. В частности, сколько раз вызывается ",
        '15' =>
        "? На какую процедуру она диспетчирует в каждом случае?",
        '16' =>
        "Рис. 2.24. Представление ",
        '17' =>
        " в декартовой форме",
    ],
];
