<?php

return [
    'title' => 'Обобщенная операция raise',
    'description' =>
        "Предположим, что Вы разрабатываете обобщенную арифметическую систему для работы с башней типов, показанной на рис. 2.25: целые, рациональные, действительные, комплексные. " .
        "Для каждого из типов (кроме комплексного), разработайте процедуру, поднимающую объект на один уровень в башне. " .
        "Покажите, как ввести обобщенную операцию raise, которая будет работать для всех типов (кроме комплексных чисел).",
];
