<?php

return [
    'title' => 'Обобщенная операция raise',
    'description' => [
        '1' =>
        "Предположим, что Вы разрабатываете обобщенную арифметическую систему для работы с башней типов, показанной на рис. 2.25: целые, рациональные, действительные, комплексные. " .
        "Для каждого из типов (кроме комплексного), разработайте процедуру, поднимающую объект на один уровень в башне. " .
        "Покажите, как ввести обобщенную операцию ",
        '2' =>
        ", которая будет работать для всех типов (кроме комплексных чисел).",
        '3' =>
        "Рис. 2.25. Башня типов",
    ],
];
