<?php

return [
    'title' => 'Последовательный подъем',
    'description' => [
        '1' =>
        "Используя операцию ",
        '2' =>
        " из упражнения ",
        '3' =>
        ", измените процедуру ",
        '4' =>
        " так, чтобы она приводила аргументы к одному типу путем последовательного подъема, как описано в этом разделе. " .
        "Потребуется придумать способ проверки, какой из двух типов выше по башне. " .
        "Сделайте это способом, «совместимым» с остальной системой, так, чтобы не возникало проблем при добавлении к башне новых типов.",
    ],
];
