<?php

return [
    'title' => 'Обобщение комплексных чисел',
    'description' => [
        '1' =>
        "Допустим, нам хочется работать с комплексными числами, чьи действительные и мнимые части, модули и аргументы могут быть обыкновенными числами, рациональными числами либо любыми другими, какие нам захочется добавить к системе. " .
        "Опишите и реализуйте изменения в системе, которые потребуются, чтобы добавить такую возможность. " .
        "Вам придется определить операции вроде ",
        '2' =>
        " (синус) и ",
        '3' =>
        " (косинус), обобщенные на обыкновенные и рациональные числа.",
    ],
];
