<?php

return [
    'title' => "Обобщенные операции в пакете арифметики рациональных чисел",
    'description' => [
        '1' =>
        "Модифицируйте пакет арифметики рациональных чисел, заставив его пользоваться обобщенными операциями, но при этом измените ",
        '2' =>
        ", чтобы она не пыталась сокращать дроби. Проверьте систему, применив ",
        '3' =>
        " к двум многочленам, и получив рациональную функцию",
        '4' =>
        "Сложите теперь ",
        '5' =>
        " саму с собой, используя ",
        '6' =>
        ". Вы увидите, что процедура сложения не приводит дроби к наименьшему знаменателю.",
    ],
];
