<?php

return [
    'title' => "Обобщенные операции в пакете арифметики рациональных чисел",
    'description' => [
        '1' =>
        "Модифицируйте пакет арифметики рациональных чисел, заставив его пользоваться обобщенными операциями, но при этом измените make-rat, чтобы она не пыталась сокращать дроби. " .
        "Проверьте систему, применив make-rational к двум многочленам, и получив рациональную функцию",
        '2' =>
        "Сложите теперь rf саму с собой, используя add. Вы увидите, что процедура сложения не приводит дроби к наименьшему знаменателю.",
    ],
];
