<?php

return [
    'title' => "Обобщенная операция",
    'description' => [
        '1' =>
        "Используя div-terms, напишите процедуру remainder-terms, и с ее помощью определите gcd-terms, как показано выше. " .
        "Напишите теперь процедуру gcd-polys, которая вычисляет НОД двух многочленов. (Процедура должна сообщать об ошибке, если входные объекты являются многочленами от разных переменных.) " .
        "Установите в систему обобщенную операцию greatest-common-divisor, которая для многочленов сводится к gcd-poly, а для обыкновенных чисел к обыкновенному gcd. " .
        "В качестве проверки, попробуйте ввести",
        '2' =>
        "и проверьте результат вручную."
    ]
];
