<?php

return [
    'title' => "Обобщенная операция",
    'description' => [
        '1' =>
        "Используя ",
        '2' =>
        ", напишите процедуру ",
        '3' =>
        ", и с ее помощью определите ",
        '4' =>
        ", как показано выше. Напишите теперь процедуру ",
        '5' =>
        ", которая вычисляет НОД двух многочленов. (Процедура должна сообщать об ошибке, если входные объекты являются многочленами от разных переменных.) " .
        "Установите в систему обобщенную операцию ",
        '6' =>
        ", которая для многочленов сводится к ",
        '7' =>
        ", а для обыкновенных чисел к обыкновенному ",
        '8' =>
        ". В качестве проверки, попробуйте ввести",
        '9' =>
        "и проверьте результат вручную.",
    ],
];
