<?php

return [
    'title' => 'Создание накопителей',
    'description1' =>
        'Накопитель (accumulator) — это процедура, которая вызывается с одним численным аргументом и собирает свои аргументы в сумму. ' .
        'При каждом вызове накопитель возвращает сумму, которую успел накопить. ' .
        'Напишите процедуру ',
    'description2' =>
        ', порождающую накопители, каждый из которых поддерживает свою отдельную сумму. ' .
        'Входной параметр ',
    'description3' =>
        ' должен указывать начальное значение суммы, например:'
];
