<?php

return [
    'title' => 'Создание накопителей',
    'description' => [
        '1' =>
        'Накопитель (accumulator) — это процедура, которая вызывается с одним численным аргументом и собирает свои аргументы в сумму. ' .
        'При каждом вызове накопитель возвращает сумму, которую успел накопить. ' .
        'Напишите процедуру ',
        '2' =>
        ', порождающую накопители, каждый из которых поддерживает свою отдельную сумму. ' .
        'Входной параметр ',
        '3' =>
        ' должен указывать начальное значение суммы, например:',
    ],
];
