<?php

return [
    'title' => 'Анализ альтернативных версий',
    'description' => [
        '1' =>
        'В процедуре ',
        '2' =>
        ' локальная переменная ',
        '3' =>
        ' создается в виде параметра ',
        '4' =>
        '. Можно было бы создать локальную переменную и явно, используя ',
        '5' =>
        ', а именно:',
        '6' =>
        'Напомним, что в разделе ',
        '7' =>
        ' говорится, что ',
        '8' =>
        ' всего лишь синтаксический сахар для вызова процедуры:',
        '9' =>
        'интерпретируется как альтернативный синтаксис для',
        '10' =>
        'С помощью модели с окружениями проанализируйте альтернативную версию ',
        '11' =>
        '. Нарисуйте картинки, подобные приведенным в этом разделе, для выражений',
        '12' =>
        'Покажите, что две версии ',
        '13' =>
        ' создают объекты с одинаковым поведением. Как различаются структуры окружений в двух версиях?',
    ],
];
