<?php

return [
    'title' => 'Анализ альтернативных версий',
    'description1' =>
        'В процедуре ',
    'description2' =>
        ' локальная переменная ',
    'description3' =>
        ' создается в виде параметра ',
    'description4' =>
        '. Можно было бы создать локальную переменную и явно, используя ',
    'description5' =>
        ', а именно:',
    'description6' =>
        'Напомним, что в разделе ',
    'description7' =>
        ' говорится, что ',
    'description8' =>
        ' всего лишь синтаксический сахар для вызова процедуры:',
    'description9' =>
        'интерпретируется как альтернативный синтаксис для',
    'description10' =>
        'С помощью модели с окружениями проанализируйте альтернативную версию ',
    'description11' =>
        '. Нарисуйте картинки, подобные приведенным в этом разделе, для выражений',
    'description12' =>
        'Покажите, что две версии ',
    'description13' =>
        ' создают объекты с одинаковым поведением. Как различаются структуры окружений в двух версиях?',
];
