<?php

return [
    'title' => 'Внутренние определения',
    'description1' =>
        'В разделе ',
    'description2' =>
        ' мы видели, как модель с окружениями описывает поведение процедур, обладающих внутренним состоянием. ' .
        'Теперь мы рассмотрели, как работают локальные определения. ' .
        'Типичная процедура с передачей сообщений пользуется и тем, и другим. ' .
        'Рассмотрим процедуру моделирования банковского счета из раздела ',
    'description3' =>
        ':',
    'description4' =>
        'Покажите, какая структура окружений создается последовательностью действий',
    'description5' =>
        'Где хранится внутреннее состояние',
    'description6' =>
        '? Предположим, что мы определяем еще один счет',
    'description7' =>
        'Каким образом удается не смешивать внутренние состояния двух счетов? ' .
        'Какие части структуры окружений общие у ',
    'description8' =>
        ' и ',
    'description9' =>
        '?',
];
