<?php

return [
    'title' => 'Внутренние определения',
    'description' => [
        '1' =>
        'В разделе ',
        '2' =>
        ' мы видели, как модель с окружениями описывает поведение процедур, обладающих внутренним состоянием. ' .
        'Теперь мы рассмотрели, как работают локальные определения. ' .
        'Типичная процедура с передачей сообщений пользуется и тем, и другим. ' .
        'Рассмотрим процедуру моделирования банковского счета из раздела ',
        '3' =>
        'Покажите, какая структура окружений создается последовательностью действий',
        '4' =>
        'Где хранится внутреннее состояние',
        '5' =>
        '? Предположим, что мы определяем еще один счет',
        '6' =>
        'Каким образом удается не смешивать внутренние состояния двух счетов? ' .
        'Какие части структуры окружений общие у ',
        '7' =>
        ' и ',
    ],
];
