<?php

return [
    'title' => 'Добавление списков',
    'description' => [
        '1' =>
        'В разделе ',
        '2' =>
        ' была введена следующая процедура для добавления одного списка к другому:',
        '3' =>
        ' порождает новый список, по очереди наращивая элементы ',
        '4' =>
        ' в начало ',
        '5' =>
        '. Процедура ',
        '6' =>
        ' подобна ',
        '7' =>
        ', но только она является не конструктором, а мутатором. ' .
        'Она склеивает списки вместе, изменяя последнюю пару ',
        '8' =>
        ' так, что ее ',
        '9' =>
        ' становится равным ',
        '10' =>
        '. (Вызов ',
        '11' =>
        ' с пустым ',
        '12' =>
        'является ошибкой.)',
        '13' =>
        'Здесь ',
        '14' =>
        ' — процедура, которая возвращает последнюю пару своего аргумента:',
        '15' =>
        'Рассмотрим последовательность действий',
        '16' =>
        'Каковы будут пропущенные ',
        '17' =>
        '? Объясните, нарисовав стрелочные диаграммы.',
        '18' =>
        'ответ',
        '19' =>
        'ответы',
    ],
];
