<?php

return [
    'title' => 'Добавление списков',
    'description1' =>
        'В разделе ',
    'description2' =>
        ' была введена следующая процедура для добавления одного списка к другому:',
    'description3' =>
        ' порождает новый список, по очереди наращивая элементы ',
    'description4' =>
        ' в начало ',
    'description5' =>
        '. Процедура ',
    'description6' =>
        ' подобна ',
    'description7' =>
        ', но только она является не конструктором, а мутатором. ' .
        'Она склеивает списки вместе, изменяя последнюю пару ',
    'description8' =>
        ' так, что ее ',
    'description9' =>
        ' становится равным ',
    'description10' =>
        '. (Вызов ',
    'description11' =>
        ' с пустым ',
    'description12' =>
        'является ошибкой.)',
    'description13' =>
        'Здесь ',
    'description14' =>
        ' — процедура, которая возвращает последнюю пару своего аргумента:',
    'description15' =>
        'Рассмотрим последовательность действий',
    'description16' =>
        'Каковы будут пропущенные ',
    'description17' =>
        '? Объясните, нарисовав стрелочные диаграммы.',
    'description18' =>
        'ответ',
    'description19' =>
        'ответы',
];
