<?php

return [
    'title' => 'Процедура Mystery',
    'description1' =>
        'Следующая процедура, хотя и сложна для понимания, вполне может оказаться полезной:',
    'description2' =>
        ' пользуется «временной» переменной ',
    'description3' =>
        ', чтобы сохранить старое значение ',
    'description4' =>
        ' пары ',
    'description5' =>
        ', поскольку ',
    'description6' =>
        ' на следующей строке разрушает это значение ',
    'description7' =>
        '. Объясните, что за задачу выполняет ',
    'description8' =>
        '. Предположим, что переменная ',
    'description9' =>
        ' определена выражением ',
    'description10' =>
        '. Нарисуйте диаграмму, которая изображает список, являющийся значением ',
    'description11' =>
        '. Допустим, что теперь мы выполняем ',
    'description12' =>
        '. Нарисуйте стрелочные диаграммы, которые показывают структуры ',
    'description13' =>
        ' и ',
    'description14' =>
        ' после вычисления этого выражения. Что будет напечатано в качестве значений ',
    'description15' =>
        ' и ',
    'description16' =>
        ' ?',
];
