<?php

return [
    'title' => 'Процедура Mystery',
    'description' => [
        '1' =>
        'Следующая процедура, хотя и сложна для понимания, вполне может оказаться полезной:',
        '2' =>
        ' пользуется «временной» переменной ',
        '3' =>
        ', чтобы сохранить старое значение ',
        '4' =>
        ' пары ',
        '5' =>
        ', поскольку ',
        '6' =>
        ' на следующей строке разрушает это значение ',
        '7' =>
        '. Объясните, что за задачу выполняет ',
        '8' =>
        '. Предположим, что переменная ',
        '9' =>
        ' определена выражением ',
        '10' =>
        '. Нарисуйте диаграмму, которая изображает список, являющийся значением ',
        '11' =>
        '. Допустим, что теперь мы выполняем ',
        '12' =>
        '. Нарисуйте стрелочные диаграммы, которые показывают структуры ',
        '13' =>
        ' и ',
        '14' =>
        ' после вычисления этого выражения. Что будет напечатано в качестве значений ',
        '15' =>
        ' и ',
    ],
];
