<?php

return [
    'title' => 'Процедура подсчета числа пар',
    'description' => [
        '1' =>
        'Бен Битобор решил написать процедуру для подсчета числа пар в любой списковой структуре. ' .
        '«Это легко, — думает он. — ' .
        'Число пар в любой структуре есть число пар в ',
        '2' =>
        ' плюс число пар в ',
        '3' =>
        ' плюс один на текущую пару». ' .
        'И он пишет следующую процедуру:',
        '4' =>
        'Покажите, что эта процедура ошибочна. ' .
        'В частности, нарисуйте диаграммы, представляющие списковые структуры ровно из трех пар, ' .
        'для которых Бенова процедура вернет 3; вернет 4; вернет 7; вообще никогда не завершится.',
    ],
];
