<?php

return [
    'title' => 'Количество вызовов процедуры',
    'description1' =>
        'При тестировании программ удобно иметь возможность подсчитывать, сколько раз за время вычислений была вызвана та или иная процедура. ' .
        'Напишите процедуру ',
    'description2' =>
        ', принимающую в качестве параметра процедуру ',
    'description3' =>
        ', которая сама по себе принимает один входной параметр. ' .
        'Результат, возвращаемый ',
    'description4' =>
        ' — третья процедура, назовем ее ',
    'description5' =>
        ', которая подсчитывает, сколько раз она была вызвана, при помощи внутреннего счетчика. ' .
        'Если на входе ',
    'description6' =>
        ' получает специальный символ ',
    'description7' =>
        ', она возвращает значение счетчика. ' .
        'Если же на вход подается специальный символ ',
    'description8' =>
        ' обнуляет счетчик. ' .
        'Для любого другого параметра ',
    'description9' =>
        ' возвращает результат вызова ',
    'description10' =>
        ' с этим параметром и увеличивает счетчик. ' .
        'Например, можно было бы сделать отслеживаемую версию процедуры ',
    'description11' =>
        ':'
];
