<?php

return [
    'title' => 'Количество вызовов процедуры',
    'description' => [
        '1' =>
        'При тестировании программ удобно иметь возможность подсчитывать, ' .
        'сколько раз за время вычислений была вызвана та или иная процедура. ' .
        'Напишите процедуру ',
        '2' =>
        ', принимающую в качестве параметра процедуру ',
        '3' =>
        ', которая сама по себе принимает один входной параметр. ' .
        'Результат, возвращаемый ',
        '4' =>
        ' — третья процедура, назовем ее ',
        '5' =>
        ', которая подсчитывает, сколько раз она была вызвана, при помощи внутреннего счетчика. ' .
        'Если на входе ',
        '6' =>
        ' получает специальный символ ',
        '7' =>
        ', она возвращает значение счетчика. ' .
        'Если же на вход подается специальный символ ',
        '8' =>
        ' обнуляет счетчик. ' .
        'Для любого другого параметра ',
        '9' =>
        ' возвращает результат вызова ',
        '10' =>
        ' с этим параметром и увеличивает счетчик. ' .
        'Например, можно было бы сделать отслеживаемую версию процедуры ',
        '11' =>
        ':',
    ],
];
