<?php

return [
    'title' => 'Дек',
    'description' => [
        '1' =>
        "Дек (deque, double-ended queue, «двусторонняя очередь») представляет собой последовательность, элементы в которой могут добавляться и уничтожаться как с головы, так и с хвоста. " .
        "На деках определены такие операции: конструктор ",
        '2' =>
        "предикат",
        '3' =>
        "селекторы",
        '4' =>
        "и",
        '5' =>
        "и мутаторы",
        '6' =>
        "и",
        '7' =>
        "Покажите, как представить дек при помощи пар, и напишите реализацию операций. " .
        "Все операции должны выполняться за Θ(1) шагов.",
    ],
];
