<?php

return [
    'title' => 'Обобщение одномерных и двухмерных таблиц',
    'description' => [
        '1' =>
        "Обобщая случаи одно- и двумерных таблиц, покажите, как можно реализовать таблицу, " .
        "в которой элементы хранятся с произвольным количеством ключей и различные значения могут храниться с различным количеством ключей. " .
        "Процедуры ",
        '2' =>
        "и",
        '3' =>
        "должны принимать на входе список ключей, с которыми требуется обратиться к таблице.",
    ],
];
