<?php

return [
    'title' => 'Защищенный паролем счет',
    'description' => [
        '1' =>
        'Измените процедуру ',
        '2' =>
        ' так, чтобы она создавала счета, защищенные паролем. А именно, ',
        '3' =>
        ' должна в качестве дополнительного аргумента принимать символ, например:',
        '4' =>
        'Получившийся объект-счет должен обрабатывать запросы, только если они сопровождаются паролем, с которым счет был создан, ' .
        'а в противном случае он должен жаловаться:',
    ],
];
