<?php

return [
    'title' => 'Защищенный паролем счет',
    'description1' =>
        'Измените процедуру ',
    'description2' =>
        ' так, чтобы она создавала счета, защищенные паролем. А именно, ',
    'description3' =>
        ' должна в качестве дополнительного аргумента принимать символ, например:',
    'description4' =>
        'Получившийся объект-счет должен обрабатывать запросы, только если они сопровождаются паролем, с которым счет был создан, ' .
        'а в противном случае он должен жаловаться:',
];
