<?php

return [
    'title' => 'Процедура accept-action-procedure!',
    'description' =>
        "Внутренняя процедура accept-action-procedure!, определенная в make-wire, требует, чтобы в момент, когда процедура-действие добавляется к проводу, она немедленно исполнялась. " .
        "Объясните, зачем требуется такая инициализация. В частности, проследите работу процедуры halfadder из этого текста и скажите, как отличалась бы реакция системы, если бы accept-actionprocedure! была определена как",
];
