<?php

return [
    'title' => 'Процедура accept-action-procedure!',
    'description' => [
        '1' =>
        "Внутренняя процедура",
        '2' =>
        ", определенная в",
        '3' =>
        ", требует, чтобы в момент, когда процедура-действие добавляется к проводу, она немедленно исполнялась. " .
        "Объясните, зачем требуется такая инициализация. В частности, проследите работу процедуры",
        '4' =>
        "из этого текста и скажите, как отличалась бы реакция системы, если бы",
        '5' =>
        "была определена как",
    ],
];
