<?php

return [
    'title' => "«Ограничительные» версии арифметических операций",
    'description' => [
        '1' =>
        "Процедура ",
        '2' =>
        " выглядит громоздко по сравнению со стилем определения в формате выражения:",
        '3' =>
        "Здесь ",
        '4' =>
        ", ",
        '5' =>
        " и т. п. — «ограничительные» версии арифметических операций. Например, ",
        '6' =>
        " берет в виде аргументов два соединителя, и возвращает соединитель, который связан с ними ограничением-сумматором:",
        '7' =>
        "Определите аналогичные процедуры для ",
        '8' =>
        ", ",
        '9' =>
        ", ",
        '10' =>
        " и ",
        '11' =>
        " (константа), так, чтобы можно было определять составные ограничения, как в вышеприведенном примере.",
    ],
];
