<?php

return [
    'title' => "«Ограничительные» версии арифметических операций",
    'description' => [
        '1' =>
        "Процедура celsius-fahrenheit-converter выглядит громоздко по сравнению со стилем определения в формате выражения:",
        '2' =>
        "Здесь c+, c* и т. п. — «ограничительные» версии арифметических операций. Например, c+ берет в виде аргументов два соединителя, и возвращает соединитель, который связан с ними ограничением-сумматором:",
        '3' =>
        "Определите аналогичные процедуры для c-, c*, c/ и cv (константа), так, чтобы можно было определять составные ограничения, как в вышеприведенном примере."
    ]
];
