<?php

return [
    'title' => "Общий счет",
    'description' => [
        '1' =>
        "Пусть Петр, Павел и Мария имеют общий счет, на котором вначале лежит 100 долларов. " .
        "Петр кладет на счет 10 долларов, одновременно с этим Павел берет 20, а Мария берет половину денег со счета. При этом они выполняют следующие операции:",
        '2' =>
        "а. Перечислите возможные значения balance после завершения операций, предполагая, что банковская система требует от транзакций исполняться последовательно в каком-то порядке.",
        '3' =>
        "б. Назовите какие-нибудь другие значения, которые могли бы получиться, если бы система разрешала операциям чередоваться. Нарисуйте временные диаграммы, подобные рис. 3.29, чтобы объяснить, как возникают такие результаты."
    ]
];
