<?php

return [
    'title' => "Изменение make-account",
    'description' => [
        '1' =>
        "Бен Битобор говорит, что слишком расточительно в ответ на каждое сообщение ",
        '2' =>
        " и ",
        '3' =>
        " создавать по новой сериализованной процедуре. Он говорит, что можно изменить ",
        '4' =>
        " так, чтобы все вызовы ",
        '5' =>
        " происходили вне процедуры ",
        '6' =>
        ". Таким образом, счет будет возвращать одну и ту же сериализованную процедуру (созданную тогда же, когда и сам счет) каждый раз, когда у него просят процедуру снятия денег:",
        '7' =>
        "Безопасно ли такое изменение? В частности, есть ли разница в том, в каком порядке может происходить параллельное выполнение в этих двух версиях ",
        '8' =>
        "?",
    ],
];
