<?php

return [
    'title' => 'Нарисуйте временную диаграмму',
    'description' => [
        '1' =>
        "Допустим, что мы реализуем ",
        '2' =>
        " в виде обыкновенной процедуры, как показано в тексте, не пытаясь сделать ее атомарной. " .
        "Нарисуйте временную диаграмму, подобную диаграмме на рис. 3.29, и покажите, как реализация мьютекса может ошибиться и позволить двум процессам одновременно захватить мьютекс.",
        '3' =>
        "Рис. 3.29. Временная диаграмма, показывающая, как чередование действий при двух операциях со счетом может привести к неправильному балансу.",
    ],
];
