<?php

return [
    'title' => "Реализации семафоров",
    'description' => [
        '1' =>
        "Семафор (размера ",
        '2' =>
        ") представляет собой обобщение мьютекса. Подобно мьютексу, семафор поддерживает операции захвата и освобождения, но захватить его одновременно могут до ",
        '3' =>
        " процессов. Прочие процессы, которые попытаются захватить семафор, должны будут ждать освобождения. Дайте реализацию семафоров",
        '4' =>
        "а. в терминах мьютексов.",
        '5' =>
        "б. в терминах атомарных операций ",
        '6' =>
        ".",
    ],
];
