<?php

return [
    'title' => 'Обобщение stream-map',
    'description' =>
        "Закончите следующее определение, которое обобщает процедуру stream-map, чтобы она позволяла использовать процедуры от нескольких аргументов, подобно стандартной map языка Scheme. " .
        "Этот вариант map принимает процедуру от n аргументов и n списков и применяет процедуру ко всем первым элементам списков, всем вторым элементам списков и так далее. " .
        "Возвращается список результатов. Например:",
];
