<?php

return [
    'title' => 'Обобщение stream-map',
    'description' => [
        '1' =>
        "Закончите следующее определение, которое обобщает процедуру ",
        '2' =>
        ", чтобы она позволяла использовать процедуры от нескольких аргументов, подобно стандартной ",
        '3' =>
        " языка Scheme. Этот вариант ",
        '4' =>
        " принимает процедуру от ",
        '5' =>
        " аргументов и ",
        '6' =>
        " списков и применяет процедуру ко всем первым элементам списков, всем вторым элементам списков и так далее. " .
        "Возвращается список результатов. Например:",
    ],
];
