<?php

return [
    'title' => "Значение sum",
    'description' => [
        '1' =>
        "Рассмотрим последовательность выражений",
        '2' =>
        "Каково значение ",
        '3' =>
        " после вычисления каждого из этих выражений? Что печатается при вычислении выражений ",
        '4' =>
        " и ",
        '5' =>
        "? Изменился бы этот результат, если бы мы реализовали ",
        '6' =>
        " просто как ",
        '7' =>
        ", не применяя оптимизацию через ",
        '8' =>
        "? Объясните свой ответ.",
    ],
];
