<?php

return [
    'title' => 'Сложения при вычислении чисел Фибоначчи',
    'description' => [
        '1' =>
        "Сколько сложений происходит при вычислении ",
        '2' =>
        "-го числа Фибоначчи, в случае, когда мы используем определение ",
        '3' =>
        " через процедуру ",
        '4' =>
        "? Покажите, что число сложений выросло бы экспоненциально, если бы мы реализовали ",
        '5' =>
        " просто как ",
        '6' =>
        ", без оптимизации через процедуру ",
        '7' =>
        " из раздела 3.5.1.",
    ],
];
