<?php

return [
    'title' => 'Усовершенствованный генератор случайных чисел',
    'description' => [
        '1' =>
        'Полезно иметь возможность сбросить генератор случайных чисел, ' .
        'чтобы получить последовательность, которая начинается с некоторого числа. ' .
        'Постройте новую процедуру ',
        '2' =>
        ', которая вызывается с аргументом. Этот аргумент должен быть либо символом ',
        '3' =>
        ', либо символом ',
        '4' =>
        '. Процедура работает так: ',
        '5' =>
        ' порождает новое случайное число; ',
        '6' =>
        ' сбрасывает внутреннюю переменную состояния в указанное ',
        '7' =>
        '. Таким образом, сбрасывая значения, можно получать повторяющиеся последовательности. ' .
        'Эта возможность очень полезна при тестировании и отладке программ, использующих случайные числа.',
        '8' =>
        'новое-значение',
    ],
];
