<?php

return [
    'title' => 'Усовершенствованный генератор случайных чисел',
    'description1' =>
        'Полезно иметь возможность сбросить генератор случайных чисел, чтобы получить последовательность, которая начинается с некоторого числа. ' .
        'Постройте новую процедуру ',
    'description2' =>
        ', которая вызывается с аргументом. Этот аргумент должен быть либо символом ',
    'description3' =>
        ', либо символом ',
    'description4' =>
        '. Процедура работает так: ',
    'description5' =>
        ' порождает новое случайное число; ',
    'description6' =>
        ' сбрасывает внутреннюю переменную состояния в указанное ',
    'description7' =>
        '. Таким образом, сбрасывая значения, можно получать повторяющиеся последовательности. ' .
        'Эта возможность очень полезна при тестировании и отладке программ, использующих случайные числа.',
    'description8' =>
        'новое-значение'
];
