<?php

return [
    'title' => "Перемножение последовательностей",
    'description' => [
        '1' =>
        "Если степенной ряд представляется в виде потока своих коэффициентов, как в упражнении ",
        '2' =>
        ", то сумма последовательностей реализуется посредством ",
        '3' =>
        ". Завершите определение следующей процедуры для перемножения последовательностей:",
        '4' =>
        "Можете проверить свою процедуру, убедившись, что ",
        '5' =>
        " с помощью последовательностей из упражнения ",
    ],
];
