<?php

return [
    'title' => "Перемножение последовательностей",
    'description' => [
        '1' =>
        "Если степенной ряд представляется в виде потока своих коэффициентов, как в упражнении 3.59, то сумма последовательностей реализуется посредством add-streams. " .
        "Завершите определение следующей процедуры для перемножения последовательностей:",
        '2' =>
        "Можете проверить свою процедуру, убедившись, что sin²x + cos²x = 1 с помощью последовательностей из упражнения 3.59."
    ]
];
