<?php

return [
    'title' => "Процедура invert-unit-series",
    'description' => [
        '1' =>
        "Пусть ",
        '2' =>
        " будет степенным рядом (упражнение ",
        '3' =>
        ") с постоянным членом ",
        '4' =>
        ". Предположим, что мы хотим найти степенной ряд ",
        '5' =>
        ", то есть такой ряд ",
        '6' =>
        ", что ",
        '7' =>
        ". Запишем ",
        '8' =>
        ", где ",
        '9' =>
        " — часть ",
        '10' =>
        " после постоянного члена. Тогда мы можем решить уравнение для ",
        '11' =>
        " так:",
        '12' =>
        "Другими словами, ",
        '13' =>
        " есть степенной ряд с постоянным членом ",
        '14' =>
        ", чьи члены с более высокими степенями определяются как минус произведение ",
        '15' =>
        " и ",
        '16' =>
        ". Воспользовавшись этим, напишите процедуру ",
        '17' =>
        ", которая вычисляет ",
        '18' =>
        " для степенного ряда ",
        '19' =>
        " с постоянным членом ",
        '20' =>
        ". Вам потребуется ",
        '21' =>
        " из упражнения ",
    ],
];
