<?php

return [
    'title' => 'Процедура div-series',
    'description' => [
        '1' =>
        "При помощи результатов упражнений ",
        '2' =>
        " и ",
        '3' =>
        " определите процедуру ",
        '4' =>
        ", которая делит один степенной ряд на другой. ",
        '5' =>
        " должна работать для любых двух рядов, при условии, что ряд в знаменателе начинается с ненулевого постоянного члена. (Если в знаменателе постоянный член равен нулю, ",
        '6' =>
        " должна сообщать об ошибке.) Покажите, как при помощи ",
        '7' =>
        " и результата упражнения ",
        '8' =>
        " получить степенной ряд для тангенса.",
    ],
];
