<?php

return [
    'title' => "Эффективность процедуры sqrt-stream",
    'description' => [
        '1' =>
        "Хьюго Дум спрашивает, почему нельзя было написать ",
        '2' =>
        " более простым способом, без внутренней переменной ",
        '3' =>
        ":",
        '4' =>
        "Лиза П. Хакер отвечает, что эта версия процедуры значительно менее эффективна, поскольку производит избыточные вычисления. Объясните Лизин ответ. " .
        "Сохранилось бы отличие в эффективности, если бы реализация ",
        '5' =>
        " использовала только ",
        '6' =>
        ", без оптимизации через ",
        '7' =>
        " (см. раздел 3.5.1)?",
    ],
];
