<?php

return [
    'title' => 'Процедура stream-limit',
    'description' => [
        '1' =>
        "Напишите процедуру ",
        '2' =>
        ", которая в качестве аргумента принимает поток и число (погрешность). " .
        "Она должна просматривать поток, пока не найдется два элемента подряд, различающихся меньше, чем на погрешность, и возвращать второй из этих элементов. " .
        "При помощи этой процедуры можно будет вычислять квадратные корни с заданной точностью так:",
    ],
];
