<?php

return [
    'title' => 'Порядок пар в потоке',
    'description' => [
        '1' =>
        "Рассмотрим поток ",
        '2' =>
        ". Можете ли Вы что-то сказать о порядке, в котором пары попадают в поток? Например, сколько приблизительно пар предшествуют паре ",
        '3' =>
        "? Паре ",
        '4' =>
        "? ",
        '5' =>
        "? (Если Вы способны предоставить точные математические утверждения, — прекрасно. Однако если Вы увязаете в деталях, достаточно качественных оценок.)",
    ],
];
