<?php

return [
    'title' => "Альтернативное определение pairs",
    'description' => [
        '1' =>
        "Хьюго Дум считает, что построение потока пар из трех частей — процедура слишком сложная. " .
        "Он предлагает вместо того, чтобы отделять пару ",
        '2' =>
        ", работать с первой строкой целиком:",
        '3' =>
        "Будет ли такой код работать? Посмотрите, что произойдет, если мы попытаемся вычислить ",
        '4' =>
        ", используя определение Хьюго.",
    ],
];
