<?php

return [
    'title' => 'Процедура triples',
    'description' => [
        '1' =>
        "Напишите процедуру ",
        '2' =>
        ", которая берет три бесконечных потока ",
        '3' =>
        ", ",
        '4' =>
        " и ",
        '5' =>
        ", и порождает поток троек ",
        '6' =>
        ", таких, что ",
        '7' =>
        ". С помощью ",
        '8' =>
        " породите поток всех Пифагоровых троек натуральных чисел, т. е. таких троек ",
        '9' =>
        ", что ",
        '10' =>
        " и ",
        '11' =>
        ".",
    ],
];
