<?php

return [
    'title' => 'Совместные счета',
    'description1' =>
        'Рассмотрим объекты-банковские счета, создаваемые процедурой ',
    'description2' =>
        ', и снабженные паролями, как это описано в упражнении ',
    'description3' =>
        '. Предположим, что наша банковская система требует от нас умения порождать совместные счета. ' .
        'Напишите процедуру ',
    'description4' =>
        ', которая это делает. ',
    'description5' =>
        '  должна принимать три аргумента. Первый из них — защищенный паролем счет. ' .
        'Второй обязан совпадать с паролем, с которым этот счет был создан, иначе',
    'description6' =>
        'откажется работать. ' .
        '   Третий аргумент — новый пароль. ',
    'description7' =>
        ' открывает дополнительный доступ к счету, с использованием нового пароля. Например, если банковский счет ',
    'description8' =>
        ' был создан с паролем ',
    'description9' =>
        ', то',
    'description10' =>
        'позволит нам проводить операции с ',
    'description11' =>
        ', используя имя ',
    'description12' =>
        ' и пароль ',
    'description13' =>
        '. Вам может потребоваться переработать решение упражнения ',
    'description14' =>
        ', чтобы добавить эту новую возможность.',
];
