<?php

return [
    'title' => 'Совместные счета',
    'description' => [
        '1' =>
        'Рассмотрим объекты-банковские счета, создаваемые процедурой ',
        '2' =>
        ', и снабженные паролями, как это описано в упражнении ',
        '3' =>
        '. Предположим, что наша банковская система требует от нас умения порождать совместные счета. ' .
        'Напишите процедуру ',
        '4' =>
        ', которая это делает. ',
        '5' =>
        '  должна принимать три аргумента. Первый из них — защищенный паролем счет. ' .
        'Второй обязан совпадать с паролем, с которым этот счет был создан, иначе',
        '6' =>
        'откажется работать. ' .
        '   Третий аргумент — новый пароль. ',
        '7' =>
        ' открывает дополнительный доступ к счету, с использованием нового пароля. Например, если банковский счет ',
        '8' =>
        ' был создан с паролем ',
        '9' =>
        ', то',
        '10' =>
        'позволит нам проводить операции с ',
        '11' =>
        ', используя имя ',
        '12' =>
        ' и пароль ',
        '13' =>
        '. Вам может потребоваться переработать решение упражнения ',
        '14' =>
        ', чтобы добавить эту новую возможность.',
    ],
];
