<?php

return [
    'title' => "Функция взвешивания",
    'description' => [
        '1' =>
        "Интересно было бы уметь порождать потоки в каком-либо полезном порядке, а не в порядке, задаваемом к случаю придуманным процессом чередования. " .
        "Можно воспользоваться методом, подобным процедуре ",
        '2' =>
        " из упражнения ",
        '3' =>
        ", если мы определим способ сказать, что одна пара целых чисел «меньше» другой. Один из способов состоит в том, чтобы определить «функцию взвешивания» ",
        '4' =>
        " и постановить, что ",
        '5' =>
        " меньше, чем ",
        '6' =>
        ", если ",
        '7' =>
        ". Напишите процедуру ",
        '8' =>
        ", которая во всем подобна ",
        '9' =>
        ", но только в качестве дополнительного аргумента принимает процедуру ",
        '10' =>
        ", которая вычисляет вес пары, и используется для определения порядка, в котором элементы должны появляться в получающемся смешанном потоке. При помощи ",
        '11' =>
        " напишите процедуру ",
        '12' =>
        ", обобщающую ",
        '13' =>
        ". Она должна принимать два потока и процедуру, вычисляющую функцию взвешивания, и порождать поток пар, упорядоченных по весу. " .
        "Породите, используя эту процедуру:",
        '14' =>
        "а. Поток всех пар натуральных чисел ",
        '15' =>
        " где ",
        '16' =>
        ", упорядоченных по сумме ",
        '17' =>
        ".",
        '18' =>
        "б. поток всех пар натуральных чисел ",
        '19' =>
        ", где ",
        '20' =>
        ", ни ",
        '21' =>
        ", ни ",
        '22' =>
        " не делится ни на ",
        '23' =>
        ", ни на ",
        '24' =>
        ", ни на ",
        '25' =>
        ", и пары упорядочены по значению суммы ",
        '26' =>
        ".",
    ],
];
