<?php

return [
    'title' => "RC-цепь",
    'description' => [
        '1' =>
        "Рис. 3.33. RC-цепь и связанная с ней диаграмма потока сигналов.",
        '2' =>
        "Можно моделировать электрические цепи с помощью потоков, представляющих значения тока или напряжения в определенные моменты времени. " .
        "Допустим, например, что у нас имеется цепь ",
        '3' =>
        " (RC circuit), состоящая из резистора с сопротивлением ",
        '4' =>
        " и конденсатора емкостью ",
        '5' =>
        ", соединенных последовательно. Значение напряжения ",
        '6' =>
        " в зависимости от заданного тока ",
        '7' =>
        " определяется формулой, показанной на рис. 3.33. Структура формулы показана на прилагаемой диаграмме потока сигналов.",
        '8' =>
        "Напишите процедуру ",
        '9' =>
        ", моделирующую эту цепь. На входе ",
        '10' =>
        " должна получать значения ",
        '11' =>
        ", ",
        '12' =>
        " и ",
        '13' =>
        ", и выдавать процедуру, которая принимает на входе поток значений тока ",
        '14' =>
        " и начальное значение напряжения ",
        '15' =>
        ", а на выходе выдает поток значений напряжения ",
        '16' =>
        ". Например, у Вас должна быть возможность смоделировать при помощи ",
        '17' =>
        " ",
        '18' =>
        "-цепь с ",
        '19' =>
        " ом, ",
        '20' =>
        " фарад, и временным шагом в ",
        '21' =>
        " секунды, вычислив ",
        '22' =>
        ". Здесь ",
        '23' =>
        " определяется как процедура, которая принимает на входе поток, представляющий временную последовательность токов, и исходное напряжение на конденсаторе, а на выходе дает временной поток напряжений.",
    ],
];
