<?php

return [
    'title' => "Переходы входного сигнала через ноль",
    'description' => [
        '1' =>
        "Лиза П. Хакер разрабатывает систему для обработки сигналов, приходящих от физических сенсоров. " .
        "Один из важных инструментов, который она хочет построить, — это сигнал, описывающий переходы входного сигнала через ноль (zero crossings). " .
        "Выходной сигнал должен равняться ",
        '2' =>
        ", когда сигнал на входе меняется с отрицательного на положительный, ",
        '3' =>
        ", когда сигнал меняется с положительного на отрицательный, и ",
        '4' =>
        " в остальных случаях. (Допустим, что знак нулевого входа положителен). " .
        "Например, типичный входной сигнал и связанный с ним сигнал перехода через ноль могут выглядеть так:",
        '5' =>
        "В Лизиной системе сигнал от сенсора представляется как поток ",
        '6' =>
        ", а ",
        '7' =>
        " представляет соответствующий поток пересечений нуля. Для начала Лиза пишет процедуру ",
        '8' =>
        ", которая берет два значения в качестве аргументов и, сравнив их знаки, выдает ",
        '9' =>
        ", ",
        '10' =>
        " или ",
        '11' =>
        ". Затем она строит поток переходов через ноль следующим образом:",
        '12' =>
        "Мимо проходит Лизина начальница Ева Лу Атор и замечает, что программа приблизительно равносильна следующей, написанной с использованием обобщенной версии ",
        '13' =>
        " из упражнения ",
        '14' =>
        ":",
        '15' =>
        "Завершите программу, вставив необходимое ",
        '16' =>
        ".",
    ],
];
