<?php

return [
    'title' => "Модификация процедуры integral",
    'description' => [
        '1' =>
        "Вышеприведенная процедура ",
        '2' =>
        " была аналогична «непрямому» определению бесконечного потока натуральных чисел из раздела 3.5.2. " .
        "В виде альтернативы можно дать определение ",
        '3' =>
        ", более похожее на ",
        '4' =>
        " (также в разделе 3.5.2):",
        '5' =>
        "В системах с циклами эта реализациея порождает такие же проблемы, как и наша исходная версия ",
        '6' =>
        ". Модифицируйте процедуру так, чтобы она ожидала ",
        '7' =>
        " как задержанный аргумент, а следовательно, могла быть использована в процедуре ",
        '8' =>
        ".",
    ],
];
