<?php

return [
    'title' => "Процедура solve-2nd",
    'description' => [
        '1' =>
        "Рис. 3.35. Диаграмма потока сигналов для решения линейного дифференциального уравнения второго порядка.",
        '2' =>
        "Рассмотрим задачу проектирования системы обработки сигналов для решения гомогенных линейных дифференциальных уравнений второго порядка",
        '3' =>
        "Выходной поток, моделирующий ",
        '4' =>
        ", порождается сетью, содержащей цикл. Этот цикл возникает потому, что значение ",
        '5' =>
        " зависит от значений ",
        '6' =>
        " и ",
        '7' =>
        ", а они оба получаются интегрированием ",
        '8' =>
        ". Диаграмма, которую нам хотелось бы закодировать, показана на рис. 3.35. Напишите процедуру ",
        '9' =>
        ", которая в качестве аргументов берет константы ",
        '10' =>
        ", ",
        '11' =>
        " и ",
        '12' =>
        " и начальные значения ",
        '13' =>
        " и ",
        '14' =>
        " для ",
        '15' =>
        " и ",
        '16' =>
        ", и порождает поток последовательных значений ",
        '17' =>
        ".",
    ],
];
