<?php

return [
    'title' => 'Порядок вычисления подвыражений',
    'description1' =>
        'Когда в разделе ',
    'description2' =>
        ' мы определяли модель вычислений, мы сказали, что первым шагом при вычислении выражения является вычисление его подвыражений. ' .
        'Однако мы нигде не указали порядок, в котором проходит вычисление подвыражений (слева направо или справа налево). ' .
        'Когда мы вводим присваивание, порядок, в котором вычисляются аргументы процедуры, может повлиять на результат. ' .
        'Определите простую процедуру ',
    'description3' =>
        ', так, чтобы вычисление ',
    'description4' =>
        ' возвращало ',
    'description5' =>
        ', если аргументы ',
    'description6' =>
        ' вычисляются слева направо, и ',
    'description7' =>
        ', если они вычисляются справа налево.',
];
