<?php

return [
    'title' => 'Порядок вычисления подвыражений',
    'description' => [
        '1' =>
        'Когда в разделе ',
        '2' =>
        ' мы определяли модель вычислений, мы сказали, что первым шагом при вычислении выражения является вычисление его подвыражений. ' .
        'Однако мы нигде не указали порядок, в котором проходит вычисление подвыражений (слева направо или справа налево). ' .
        'Когда мы вводим присваивание, порядок, в котором вычисляются аргументы процедуры, может повлиять на результат. ' .
        'Определите простую процедуру ',
        '3' =>
        ', так, чтобы вычисление ',
        '4' =>
        ' возвращало ',
        '5' =>
        ', если аргументы ',
        '6' =>
        ' вычисляются слева направо, и ',
        '7' =>
        ', если они вычисляются справа налево.',
    ],
];
