<?php

return [
    'title' => "Последовательная RLC-цепь",
    'description' => [
        '1' =>
        "Последовательная ",
        '2' =>
        "-цепь (series RLC circuit) состоит из резистора, конденсатора и катушки индуктивности, соединенных последовательно, как показано на рис. 3.36. " .
        "Если сопротивление, индуктивность и емкость равны, соответственно, ",
        '3' =>
        ", ",
        '4' =>
        " и ",
        '5' =>
        ", то отношения между напряжением ",
        '6' =>
        " и током ",
        '7' =>
        " на трех элементах описываются уравнениями",
        '8' =>
        "а цепь диктует соотношения",
        '9' =>
        "Сочетание этих условий показывает, что состояние цепи (характеризуемое через ",
        '10' =>
        ", напряжение на конденсаторе, и ",
        '11' =>
        ", ток через катушку) описывается парой дифференциальных уравнений",
        '12' =>
        "Диаграмма потока сигналов, представляющая эту систему дифференциальных уравнений, показана на рисунке 3.37.",
        '13' =>
        "Рис. 3.36. Последовательная RLC-цепь",
        '14' =>
        "Рис. 3.37. Диаграмма потока сигналов для решения уравнений последовательной RLC–цепи.",
        '15' =>
        "Напишите процедуру ",
        '16' =>
        ", которая в качестве аргументов берет параметры цепи ",
        '17' =>
        ", ",
        '18' =>
        " и ",
        '19' =>
        " и точность по времени ",
        '20' =>
        ". Подобно процедуре ",
        '21' =>
        " из упражнения ",
        '22' =>
        ", ",
        '23' =>
        " должна порождать процедуру, которая берет начальные значения переменных состояния ",
        '24' =>
        " и ",
        '25' =>
        " и порождает (через ",
        '26' =>
        ") пару потоков состояния ",
        '27' =>
        " и ",
        '28' =>
        ". С помощью ",
        '29' =>
        " породите пару потоков, которая моделирует поведение ",
        '30' =>
        "-цепи c ",
        '31' =>
        " ом, ",
        '32' =>
        " фарад, ",
        '33' =>
        " генри, ",
        '34' =>
        " секунды, и начальными значениями ",
        '35' =>
        " ампер и ",
        '36' =>
        " вольт.",
    ],
];
