<?php

return [
    'title' => 'Поток случайных чисел',
    'description' => [
        '1' =>
        "В упражнении ",
        '2' =>
        " обсуждалась возможность обобщить генератор случайных чисел и позволить пользователю сбрасывать последовательность случайных чисел, так, чтобы можно было порождать воспроизводимые «случайные» последовательности. " .
        "Постройте потоковый вариант такой же процедуры-генератора, которая работает со входным потоком запросов вида ",
        '3' =>
        " — породить новое число, либо ",
        '4' =>
        " — сбросить последовательность в нужную точку, и которая порождает требуемый поток случайных чисел. " .
        "Не используйте в своем решении присваивание.",
    ],
];
