<?php

return [
    'title' => 'Окружения процедуры вычисления факториала',
    'description1' =>
        'В разделе ',
    'description2' =>
        '  мы с помощью подстановочной модели анализировали две процедуры вычисления факториала, рекурсивную',
    'description3' =>
        'и итеративную',
    'description4' =>
        'Продемонстрируйте, какие структуры окружений возникнут при вычислении ',
    'description5' =>
        ' с каждой из версий процедуры ',
    'description6' =>
        '.'
];
