<?php

return [
    'title' => 'Разработайте новый синтаксис для Scheme',
    'description' => [
        '1' =>
        "При помощи абстракции данных мы смогли написать процедуру ",
        '2' =>
        " так, что она не зависит от конкретного синтаксиса интерпретируемого языка. Чтобы проиллюстрировать это свойство, разработайте новый " .
        "синтаксис для Scheme, изменив процедуры из этого раздела и ничего не трогая в ",
        '3' =>
        " и ",
        '4' =>
        ".",
    ],
];
