<?php

return [
    'title' => 'Особая форма make-unbound!',
    'description' => [
        '1' =>
        "Scheme позволяет создавать новые связывания через ",
        '2' =>
        ", но не дает никакого способа избавиться от связывания. Реализуйте в интерпретаторе особую форму ",
        '3' =>
        ", которая изымает связывание данного символа из окружения, в котором ",
        '4' =>
        " выполняется. Задача определена не до конца. Например, нужно ли удалять связывания в других кадрах, кроме первого? Дополните спецификацию и " .
        "объясните свой выбор вариантов.",
    ],
];
