<?php

return [
    'title' => 'Почему у Хьюго не работает map?',
    'description' => [
        '1' =>
        "Ева Лу Атор и Хьюго Дум экспериментируют с метациклическим интерпретатором каждый по отдельности. Ева вводит определение ",
        '2' =>
        " и запускает несколько тестовых программ с его использованием. Они замечательно работают. Хьюго, со своей стороны, ввел системную версию ",
        '3' =>
        " как примитив метациклического интерпретатора. Когда он пытается его выполнить, все ломается самым ужасным образом. Объясните, почему у Хьюго ",
        '4' =>
        " не работает, а у Евы работает.",
    ],
];
