<?php

return [
    'title' => 'Покажите, что невозможно написать процедуру halts?',
    'description' => [
        '1' =>
        "Если даны одноаргументная процедура ",
        '2' =>
        " и объект ",
        '3' =>
        ", то говорят, что ",
        '4' =>
        " «останавливается» на ",
        '5' =>
        ", если выражение ",
        '6' =>
        " возвращает значение (а не печатает сообщение об ошибке или выполняется вечно). Покажите, что невозможно написать процедуру ",
        '7' =>
        ", которая бы точно определяла для любой процедуры ",
        '8' =>
        " и любого объекта ",
        '9' =>
        ", останавливается ли ",
        '10' =>
        " на ",
        '11' =>
        ". Используйте следующее рассуждение: если бы имелась такая процедура ",
        '12' =>
        ", можно было бы написать следующую программу:",
        '13' =>
        "Теперь рассмотрите выражение ",
        '14' =>
        " и покажите, что любое возможное завершение (остановка или вечное выполнение) нарушает требуемое поведение ",
        '15' =>
        ".",
    ],
];
