<?php

return [
    'title' => 'Реализации обработки внутренних определений',
    'description' => [
        '1' =>
        "В этом упражнении мы реализуем только что описанный метод обработки внутренних определений. " .
        "Мы предполагаем, что интерпретатор поддерживает ",
        '2' =>
        " (см. упражнение ",
        '3' =>
        ").",
        '4' =>
        "а. Измените процедуру ",
        '5' =>
        " (раздел 4.1.3) так, чтобы она, обнаруживая в качестве значения символ ",
        '6' =>
        ", сообщала об ошибке.",
        '7' =>
        "б. Напишите процедуру ",
        '8' =>
        ", которая берет тело процедуры и возвращает его эквивалент без внутренних определений, выполняя описанное нами преобразование.",
        '9' =>
        "в. Вставьте ",
        '10' =>
        " в интерпретатор, либо в ",
        '11' =>
        ", либо в ",
        '12' =>
        ". Какое из этих мест лучше? Почему?",
    ],
];
