<?php

return [
    'title' => 'Нарисуйте диаграммы окружения',
    'description' => "Нарисуйте диаграммы окружения, которое находится в силе в момент выполнения выражения " .
    "<e3> из процедуры выше по тексту, и сравните его устройство при последовательной обработке определений " .
    "и при описанном выше преобразовании. Откуда в преобразованной программе берется дополнительный кадр? " .
    "Объясните, почему это различие никогда не отражается на поведении корректных программ. Придумайте, как " .
    "заставить интерпретатор реализовать правило «одновременной» сферы действия для внутренних определений " .
    "без создания дополнительного кадра."
];
