<?php

return [
    'title' => 'Альтернативная стратегия обработки определений',
    'description' => [
        '1' => "Рассмотрим альтернативную стратегию обработки определений, которая переводит пример из текста в",
        '2' => "Здесь a и b представляют новые имена переменных, созданные интерпретатором, которые не " .
        "встречаются в пользовательской программе. Рассмотрим процедуру solve из раздела 3.5.4:",
        '3' => "Будет ли эта процедура работать, если внутренние определения преобразуются так, как предлагается " .
        "в этом упражнении? А если так, как в тексте раздела? Объясните.",
    ],
];
