<?php

return [
    'title' => 'Альтернативная стратегия обработки определений',
    'description' => [
        '1' =>
        "Рассмотрим альтернативную стратегию обработки определений, которая переводит пример из текста в",
        '2' =>
        "Здесь ",
        '3' =>
        " и ",
        '4' =>
        " представляют новые имена переменных, созданные интерпретатором, которые не встречаются в пользовательской программе. Рассмотрим процедуру ",
        '5' =>
        " из раздела 3.5.4:",
        '6' =>
        "Будет ли эта процедура работать, если внутренние определения преобразуются так, как предлагается " .
        "в этом упражнении? А если так, как в тексте раздела? Объясните.",
    ],
];
