<?php

return [
    'title' => 'Реализация внутренних определений',
    'description' => [
        '1' =>
        "Бен Битобор, Лиза П. Хакер и Ева Лу Атор спорят о том, каким должен быть результат выражения",
        '2' =>
        "Бен говорит, что следует действовать согласно последовательному правилу для ",
        '3' =>
        ": ",
        '4' =>
        " равно ",
        '5' =>
        ", затем ",
        '6' =>
        " определяется как ",
        '7' =>
        ", так что общий результат равен ",
        '8' =>
        ". Лиза возражает, что взаимная рекурсия требует правила одновременной сферы действия для внутренних определений и нет причин " .
        "рассматривать имена процедур отдельно от прочих имен. То есть она выступает за механизм, реализованный в упражнении ",
        '9' =>
        ". При этом ",
        '10' =>
        " оказывается не определено в момент, когда вычисляется ",
        '11' =>
        ". Следовательно, по мнению Лизы, процедура должна выдавать ошибку. Ева не согласна с обоими. Она " .
        "говорит, что если определения вправду должны считаться одновременными, то ",
        '12' =>
        " как значение ",
        '13' =>
        " должно использоваться при вычислении ",
        '14' =>
        ". Следовательно, по мнению Евы, ",
        '15' =>
        " должно равняться ",
        '16' =>
        ", ",
        '17' =>
        " должно быть ",
        '18' =>
        ", а общий результат ",
        '19' =>
        ". Какую из этих точек зрения Вы поддерживаете (если у Вас нет своей четвертой)? Можете ли Вы придумать способ реализации внутренних определений, который бы работал " .
        "так, как предлагает Ева?",
    ],
];
