<?php

return [
    'title' => 'Помогите Хьюго',
    'description' => [
        '1' =>
        "Хьюго Дум хочет переупорядочить ветви ",
        '2' =>
        " так, чтобы ветвь для вызова процедур располагалась перед веткой для присваивания. Он утверждает, что при этом интерпретатор станет эффективнее: поскольку в " .
        "программах обычно больше вызовов процедур, чем присваиваний, определений и т. д., его усовершенствованный ",
        '3' =>
        " обычно будет рассматривать меньше вариантов, чем исходный, при распознавании типа выражения.",
        '4' =>
        "а. Что за ошибка содержится в плане Хьюго? (Подсказка: что сделает его интерпретатор с выражением ",
        '5' =>
        "?)",
        '6' =>
        "б. Хьюго расстроен, что его план не сработал. Он готов пойти на любые жертвы, чтобы позволить интерпретатору " .
        "распознавать вызовы процедур до того, как он проверяет все остальные типы выражений. Помогите ему, изменив синтаксис " .
        "интерпретируемого языка так, чтобы вызовы процедур начинались с символа ",
        '7' =>
        ". Например, вместо ",
        '8' =>
        " нам теперь придется писать ",
        '9' =>
        ", а вместо ",
        '10' =>
        " — ",
        '11' =>
        ".",
    ],
];
