<?php

return [
    'title' => 'Рекурсивные процедуры без letrec',
    'description' => [
        '1' =>
        "Как ни удивительно, интуитивная догадка Хьюго (в упражнении ",
        '2' =>
        ") оказывается верной. Действительно, можно строить рекурсивные процедуры без использования ",
        '3' =>
        " (и даже без ",
        '4' =>
        "), только способ это сделать намного тоньше, чем казалось Хьюго. Следующее выражение вычисляет факториал ",
        '5' =>
        " с помощью рекурсивной процедуры:",
        '6' =>
        "а. Проверьте, что это выражение на самом деле считает факториалы (вычисляя его). " .
        "Постройте аналогичное выражение для вычисления чисел Фибоначчи.",
        '7' =>
        "б. Рассмотрим следующую процедуру, включающую взаимно рекурсивные внутренние определения:",
        '8' =>
        "Восстановите пропущенные фрагменты так, чтобы получилось альтернативное определение ",
        '9' =>
        ", где нет ни внутренних определений, ни ",
        '10' =>
        ":",
    ],
];
