<?php

return [
    'title' => 'Сравните две версии analyze-sequence',
    'description' => [
        '1' =>
        "Лиза П. Хакер не понимает, зачем делать ",
        '2' =>
        " такой сложной. Все остальные процедуры анализа — простые трансформации соответствующих вычисляющих процедур (или ветвей ",
        '3' =>
        ") из раздела 4.1.1. Лиза ожидала, что ",
        '4' =>
        " будет выглядеть так:",
        '5' =>
        "Ева Лу Атор объясняет Лизе, что версия в тексте проделывает больше работы по вычислению " .
        "последовательности во время анализа. В Лизиной исполнительной процедуре вызовы частичных " .
        "исполнительных процедур, вместо того, чтобы быть встроенными, перебираются в цикле. В результате, " .
        "хотя отдельные выражения в последовательности оказываются проанализированы, сама последовательность " .
        "анализируется во время выполнения.",
        '6' =>
        "Сравните две версии ",
        '7' =>
        ". Рассмотрите, например, обычный случай (типичный для тел " .
        "процедур), когда в последовательности только одно выражение. Какую работу будет делать исполнительная " .
        "процедура, предложенная Лизой? А процедура из текста раздела? Как соотносятся эти две процедуры в " .
        "случае последовательности из двух выражений?",
    ],
];
