<?php

return [
    'title' => 'Попытка вычисления факториала',
    'description' => [
        '1' =>
        "Предположим, что мы (в обычной Scheme с аппликативным порядком вычислений) определяем ",
        '2' =>
        " как показано выше, а затем определяем ",
        '3' =>
        " через ",
        '4' =>
        ":",
        '5' =>
        "Что произойдет, если мы попытаемся вычислить ",
        '6' =>
        "? Будут ли наши определения работать в языке с нормальным порядком вычислений?",
    ],
];
