<?php

return [
    'title' => 'Важность ленивых вычислений',
    'description' => [
        '1' =>
        "Бен Битобор и Лиза П. Хакер расходятся во мнениях о важности ленивых вычислений для реализации конструкций вроде ",
        '2' =>
        ". Бен указывает, что при аппликативном порядке ",
        '3' =>
        " можно реализовать как особую форму. Лиза отвечает, что в таком случае ",
        '4' =>
        " будет просто синтаксисом, а не процедурой, которую можно использовать в сочетании с процедурами высших порядков. Проясните детали в обеих позициях. " .
        "Покажите, как реализовать ",
        '5' =>
        " в виде производного выражения (вроде ",
        '6' =>
        " или ",
        '7' =>
        "), и приведите пример ситуации, когда имеет смысл, чтобы ",
        '8' =>
        " была процедурой, а не особой формой.",
    ],
];
