<?php

return [
    'title' => 'Продемонстрируйте преимущества мемоизации',
    'description' => [
        '1' =>
        "Придумайте пример программы, которая, по Вашему мнению, будет работать намного медленнее " .
        "без мемоизации, чем с мемоизацией. Рассмотрим, помимо этого, следующую последовательность действий, " .
        "в которой процедура ",
        '2' =>
        " определена как в упражнении ",
        '3' =>
        ", а счетчик ",
        '4' =>
        " начинает с ",
        '5' =>
        ":",
        '6' =>
        "Укажите, как будет выглядеть вывод в случае с мемоизирующим интерпретатором и с немемоизирующим.",
    ],
];
