<?php

return [
    'title' => 'Продемонстрируйте преимущества мемоизации',
    'description' => [
        '1' => "Придумайте пример программы, которая, по Вашему мнению, будет работать намного медленнее " .
        "без мемоизации, чем с мемоизацией. Рассмотрим, помимо этого, следующую последовательность действий, " .
        "в которой процедура id определена как в упражнении ",
        '2' => ", а счетчик count начинает с 0:",
        '3' => "Укажите, как будет выглядеть вывод в случае с мемоизирующим интерпретатором и с немемоизирующим.",
    ],
];
