<?php

return [
    'title' => 'Перепишите eval',
    'description' => [
        '1' =>
        "Перепишите ",
        '2' =>
        " так, чтобы диспетчеризация происходила в стиле, управляемом данными. Сравните результат " .
        "с дифференцированием, управляемым данными, из упражнения ",
        '3' =>
        ". (Можно использовать ",
        '4' =>
        " составного выражения в качестве типа этого выражения, так как это хорошо сочетается с синтаксисом, реализованным в этом разделе.)",
    ],
];
