<?php

return [
    'title' => 'Измените работу интерпретатора с закавыченными выражениями',
    'description' => [
        '1' =>
        "Бен Битобор проверяет вышеописанную реализацию при помощи выражения",
        '2' =>
        "К его большому удивлению, в ответ выдается ошибка. После некоторого размышления он понимает, " .
        "что «списки», которые получаются при чтении кавычек, отличаются от списков, управляемых новыми " .
        "определениями ",
        '3' =>
        ", ",
        '4' =>
        " и ",
        '5' =>
        ". Измените работу интерпретатора с закавыченными выражениями так, чтобы " .
        "при вводе списковых выражений в цикле управления получались настоящие ленивые списки.",
    ],
];
