<?php

return [
    'title' => 'Напишите процедуру an-integer-between',
    'description' => [
        '1' =>
        "Напишите процедуру ",
        '2' =>
        ", которая возвращает целое число, лежащее между " .
        "двумя заданными границами. С ее помощью можно следующим образом реализовать процедуру для поиска Пифагоровых " .
        "троек, то есть троек чисел ",
        '3' =>
        " между заданными границами, таких, что ",
        '4' =>
        " и ",
        '5' =>
        ":",
    ],
];
