<?php

return [
    'title' => 'Порождение произвольных Пифагоровых троек',
    'description' => [
        '1' =>
        "В упражнении ",
        '2' =>
        " рассматривалась задача порождения потока всех Пифагоровых троек, без всякой верхней границы " .
        "диапазона целых чисел, в котором надо искать. Объясните, почему простая замена ",
        '3' =>
        " на ",
        '4' =>
        " в процедуре из упражнения ",
        '5' =>
        " не является адекватным способом порождения произвольных Пифагоровых троек. Напишите процедуру, " .
        "которая решает эту задачу. (Это значит, что Вам нужно написать процедуру, для которой многократный " .
        "запрос ",
        '6' =>
        " в принципе способен породить все Пифагоровы тройки.)",
    ],
];
