<?php

return [
    'title' => 'Порождение произвольных Пифагоровых троек',
    'description' => [
        '1' => "В упражнении ",
        '2' => " рассматривалась задача порождения потока всех Пифагоровых троек, без всякой верхней границы " .
        "диапазона целых чисел, в котором надо искать. Объясните, почему простая замена an-integer-between на " .
        "an-integer-startingfrom в процедуре из упражнения ",
        '3' => " не является адекватным способом порождения произвольных Пифагоровых троек. Напишите процедуру, " .
        "которая решает эту задачу. (Это значит, что Вам нужно написать процедуру, для которой многократный " .
        "запрос try-again в принципе способен породить все Пифагоровы тройки.)"
    ]
];
