<?php

return [
    'title' => 'Особые формы интерпретатора',
    'description' => [
        '1' =>
        "Вспомним определения особых форм ",
        '2' =>
        " и ",
        '3' =>
        " из главы 1:",
        '4' =>
        ": выражения вычисляются слева направо. Если значение какого-то из них оказывается " .
        "ложным, возвращается ложь; оставшиеся выражения не вычисляются. Если все выражения оказываются " .
        "истинными, возвращается значение последнего из них. Если нет ни одного выражения, возвращается истина.",
        '5' =>
        ": выражения вычисляются слева направо. Если значение какого-то из них оказывается истинным, " .
        "возвращается это значение; оставшиеся выражения не вычисляются. Если все выражения оказываются ложными, " .
        "или нет ни одного выражения, возвращается ложь.",
        '6' =>
        "Введите ",
        '7' =>
        " и ",
        '8' =>
        " в качестве новых особых форм интерпретатора, определив соответствующие синтаксические процедуры и процедуры выполнения ",
        '9' =>
        " и ",
        '10' =>
        ". В качестве альтернативы покажите, как можно реализовать ",
        '11' =>
        " и ",
        '12' =>
        " в виде производных выражений.",
    ],
];
