<?php

return [
    'title' => 'Решите задачу "Лгуньи"',
    'description' => [
        '1' => 'Решите задачу "Лгуньи" (из Phillips 1934):',
        '2' => "Пять школьниц писали экзаменационную работу. Им показалось, что их родители чересчур " .
        "интересовались результатом, и поэтому они решили, что каждая девочка должна написать домой о " .
        "результатах экзамена и при этом сделать одно верное и одно неверное утверждение. Вот соответствующие " .
        "выдержки из их писем:",
        '3' => 'Бетти: "Китти была на экзамене второй, а я только третьей."',
        '4' => 'Этель: "Вам будет приятно узнать, что я написала лучше всех. Второй была Джоан."',
        '5' => 'Джоан: "Я была третьей, а бедная Этель последней."',
        '6' => 'Китти: "Я оказалась второй. Мэри была только четвертой."',
        '7' => 'Мэри: "Я была четвертой. Первое место заняла Бетти."',
        '8' => 'В каком порядке на самом деле расположились отметки девочек?'
    ]
];
