<?php

return [
    'title' => "Кто отец Лорны?",
    'description' => [
        '1' =>
        "Решите с помощью ",
        '2' =>
        "-интерпретатора следующую задачу.",
        '3' =>
        "У отца Мэри Энн Мур есть яхта, и у каждого из четверых его друзей тоже. Эти четверо друзей — полковник Даунинг, мистер Холл, сэр Барнакл Худ и доктор Паркер. " .
        "У каждого из них тоже есть по дочери, и каждый из них назвал свою яхту в честь дочери одного из своих друзей. " .
        "Яхта сэра Барнакла называется Габриэлла, яхта мистера Мура — Лорна, а у мистера Холла яхта Розалинда. Мелисса, яхта полковника Даунинга, названа в честь дочери сэра Барнакла. " .
        "Отец Габриэллы владеет яхтой, названной в честь дочери доктора Паркера. Кто отец Лорны?",
        '4' =>
        "Попытайтесь написать программу так, чтобы она работала эффективно (см. упражнение ",
        '5' =>
        "). Кроме того, определите, сколько будет решений, если не указывается, что фамилия Мэри Энн — Мур.",
    ],
];
