<?php

return [
    'title' => "Альтернативный вариант parse-verb-phrase",
    'description' => [
        '1' =>
        "Хьюго Дум говорит, что поскольку глагольная группа — это либо глагол, либо глагольная группа плюс предложная группа, было бы намного естественнее определить процедуру ",
        '2' =>
        " так (и то же сделать для именных групп):",
        '3' =>
        "Работает ли этот вариант? Изменится ли поведение программы, если мы поменяем местами выражения в ",
        '4' =>
        "?",
    ],
];
