<?php

return [
    'title' => "Порождение предложений",
    'description' => [
        '1' =>
        "Лизу П. Хакер больше интересует не анализ предложений, а их порождение. Она замечает, что если изменить процедуру ",
        '2' =>
        " так, чтобы она игнорировала «входное предложение», всегда заканчивалась успехом и порождала подходящее слово, мы сможем использовать те же программы, которые мы написали для анализа, для порождения предложений. " .
        "Реализуйте идею Лизы и покажите первые пять-шесть порожденных предложений.",
    ],
];
