<?php

return [
    'title' => 'Измените обработку cond',
    'description' => [
        '1' =>
        "В языке Scheme есть дополнительная разновидность синтаксиса вариантов ",
        '2' =>
        ", ",
        '3' =>
        ". Если результат вычисления ",
        '4' =>
        " оказывается истинным значением, то вычисляется ",
        '5' =>
        ". Его значение должно быть одноместной процедурой; эта процедура вызывается со значением ",
        '6' =>
        " в качестве аргумента, и результат этого вызова возвращается как значение выражения ",
        '7' =>
        ". Например,",
        '8' =>
        "имеет значение ",
        '9' =>
        ". Измените обработку ",
        '10' =>
        " так, чтобы она поддерживала этот расширенный синтаксис.",
    ],
];
