<?php

return [
    'title' => "Присваивание permanent-set!",
    'description' => [
        '1' =>
        "Реализуйте новую разновидность присваивания ",
        '2' =>
        " — присваивание, которое не отменяется при неудачах. Например, можно выбрать два различных элемента в списке и посчитать, сколько для этого потребовалось попыток, следующим образом:",
        '3' =>
        "Какие значения были бы напечатаны, если бы мы использовали здесь обычный ",
        '4' =>
        " вместо ",
        '5' =>
        "?",
    ],
];
