<?php

return [
    'title' => "Конструкция if-fail",
    'description' => [
        '1' =>
        "Реализуйте новую конструкцию ",
        '2' =>
        ", которая позволяет пользователю перехватить неудачу при выполнении выражения. ",
        '3' =>
        " принимает два выражения. " .
        "Первое она выполняет как обычно и, если вычисление успешно, возвращает его результат. Однако если вычисление неудачно, то возвращается значение второго выражения, как в следующем примере:",
    ],
];
