<?php

return [
    'title' => "Процедура analyze-require",
    'description' => [
        '1' =>
        "Если бы мы не догадались, что конструкцию ",
        '2' =>
        " можно реализовать как обычную процедуру с помощью ",
        '3' =>
        ", так что пользователь сам может определить ее в своей недетерминистской программе, то нам пришлось бы задать эту конструкцию в виде особой формы. Потребовались бы синтаксические процедуры",
        '4' =>
        "новая ветвь разбора в ",
        '5' =>
        ":",
        '6' =>
        "а также процедура ",
        '7' =>
        ", которая обрабатывает выражения ",
        '8' =>
        ". Допишите следующее определение ",
        '9' =>
        ":",
    ],
];
