<?php

return [
    'title' => "Составные запросы",
    'description' => [
        '1' =>
        "Сформулируйте составные запросы для получения следующей информации:",
        '2' =>
        "а. имена всех сотрудников, у которых начальником Бен Битобор, и их адреса;",
        '3' =>
        "б. все сотрудники, чья зарплата ниже, чем у Бена Битобора, вместе с их зарплатой и зарплатой Бена;",
        '4' =>
        "в. все сотрудники, у которых начальник не относится к компьютерному отделу, вместе с именем и должностью их начальника"
    ]
];
