<?php

return [
    'title' => 'Напишите синтаксическое преобразование',
    'description' => [
        '1' =>
        "Выражения ",
        '2' =>
        " производны, поскольку,",
        '3' =>
        "эквивалентно",
        '4' =>
        "Напишите синтаксическое преобразование ",
        '5' =>
        ", которое сводит вычисление ",
        '6' =>
        "-выражений к вычислению комбинаций указанного вида, и добавьте соответствующую ветку для обработки ",
        '7' =>
        " c ",
        '8' =>
        ".",
    ],
];
