<?php

return [
    'title' => "Запрос lives-near",
    'description' => [
        '1' =>
        "Подав запрос",
        '2' =>
        "Лиза П. Хакер (Alyssa P. Hacker) может найти людей, которые живут с ней рядом, и с которыми она вместе может ездить на работу. С другой стороны, когда она пытается найти все пары людей, живущих друг около друга, при помощи запроса",
        '3' =>
        "она видит, что каждая подходящая пара людей попадается в выводе дважды, например",
        '4' =>
        "Почему так происходит? Можно ли получить список людей, живущих рядом друг с другом, в котором каждая пара появлялась бы по одному разу? Ответ объясните."
    ]
];
