<?php

return [
    'title' => "Правила для last-pair",
    'description' => [
        '1' =>
        "Определите правила, которые реализуют операцию ",
        '2' =>
        " из упражнения ",
        '3' =>
        ", которая возвращает последнюю пару непустого списка. Проверьте Ваши правила на таких запросах, как ",
        '4' =>
        ", ",
        '5' =>
        " и ",
        '6' =>
        ". Правильно ли Ваши правила работают с запросами вида ",
        '7' =>
        "?",
    ],
];
