<?php

return [
    'title' => "Книга Бытия, 4",
    'description' => [
        '1' =>
        "Следующая база данных (см. книгу Бытия, 4) содержит генеалогию сыновей Ады вплоть до Адама, через Каина:",
        '2' =>
        "Сформулируйте правила, такие как «Если S сын F, а F сын G, то S внук G» и «Если W жена M, а S сын W, то S также сын M» (предполагается, что в библейские времена это в большей степени соответствовало истине, чем теперь). " .
        "Эти правила должны позволить системе найти внука Каина; сыновей Ламеха; внуков Мафусала. (В упражнении ",
        '3' =>
        " можно найти правила, с помощью которых выводятся более сложные родственные связи.)",
    ],
];
