<?php

return [
    'title' => "Бесконечный цикл",
    'description' => [
        '1' =>
        "Хьюго Дум по ошибке уничтожил в базе данных правило подчиняется (раздел 4.4.1). Обнаружив это, он быстро набивает правило заново, только, к сожалению, по ходу дела вносит небольшое изменение:",
        '2' =>
        "Сразу после того, как Хьюго ввел информацию в систему, Кон Фиден хочет посмотреть, кому подчиняется Бен Битобор (Ben Bitdiddle). Он вводит запрос",
        '3' =>
        "После ответа система проваливается в бесконечный цикл. Объясните, почему."
    ]
];
