<?php

return [
    'title' => "Правила для операции reverse",
    'description' => [
        '1' =>
        "Определите правила, с помощью которых реализуется операция ",
        '2' =>
        " из упражнения ",
        '3' =>
        ", возвращающая список, элементы которого те же, что и в исходном, но идут в обратном порядке. (Подсказка: используйте ",
        '4' =>
        ".) Могут ли Ваши правила ответить и на запрос ",
        '5' =>
        ", и на ",
        '6' =>
        "?",
    ],
];
