<?php

return [
    'title' => 'Особая форма let*',
    'description' => [
        '1' =>
        "Особая форма ",
        '2' =>
        " подобна ",
        '3' =>
        ", но только связывания переменных в ",
        '4' =>
        " происходят последовательно, и каждое следующее связывание происходит в окружении, где видны все предыдущие. Например,",
        '5' =>
        "возвращает значение ",
        '6' =>
        ". Объясните, каким образом можно переписать выражение ",
        '7' =>
        " в виде набора вложенных выражений ",
        '8' =>
        ", и напишите процедуру ",
        '9' =>
        ", которая проделывает это преобразование. Если мы уже реализовали ",
        '10' =>
        " (упражнение ",
        '11' =>
        ") и хотим теперь расширить интерпретатор так, чтобы он обрабатывал ",
        '12' =>
        ", достаточно ли будет добавить в ",
        '13' =>
        " ветвь, в которой действием записано",
        '14' =>
        "или нужно явным образом преобразовывать ",
        '15' =>
        " в набор непроизводных выражений?",
    ],
];
