<?php

return [
    'title' => "Упрощенная версия stream-flatmap",
    'description' => [
        '1' =>
        "Лиза П. Хакер предлагает использовать в negate, lisp-value и find-assertions упрощенную версию stream-flatmap. Она замечает, что в этих случаях процедура, которая отображает поток кадров, всегда порождает либо пустой поток, либо поток из одного элемента, и поэтому при слиянии этих потоков незачем использовать чередование.",
        '2' =>
        "а. Заполните пропущенные выражения в программе Лизы.",
        '3' =>
        "б. Если мы изменяем систему таким образом, меняется ли ее поведение?",
    ],
];
