<?php

return [
    'title' => "Упрощенная версия stream-flatmap",
    'description' => [
        '1' =>
        "Лиза П. Хакер предлагает использовать упрощенную версию ",
        '2' =>
        " в ",
        '3' =>
        ", ",
        '4' =>
        " и ",
        '5' =>
        ". Она замечает, что в этих случаях процедура, которая отображает поток кадров, всегда порождает либо пустой поток, либо поток из одного элемента, и поэтому при слиянии этих потоков незачем использовать чередование.",
        '6' =>
        "а. Заполните пропущенные выражения в программе Лизы.",
        '7' =>
        "б. Если мы изменяем систему таким образом, меняется ли ее поведение?",
    ],
];
