<?php

return [
    'title' => 'Именованный let',
    'description' => [
        '1' =>
        "«Именованный let» — это вариант ",
        '2' =>
        ", который имеет вид",
        '3' =>
        "",
        '4' =>
        " и ",
        '5' =>
        " такие же, как и в обычном ",
        '6' =>
        ", но только ",
        '7' =>
        " связана в ",
        '8' =>
        " с процедурой, у которой тело ",
        '9' =>
        ", а имена параметров — переменные в ",
        '10' =>
        ". Таким образом, можно неоднократно выполнять ",
        '11' =>
        ", вызывая процедуру по имени ",
        '12' =>
        ". Например, итеративную процедуру для порождения чисел Фибоначчи (раздел 1.2.2) можно переписать при помощи именованного ",
        '13' =>
        " как,",
        '14' =>
        "Измените преобразование ",
        '15' =>
        " из упражнения ",
        '16' =>
        " так, чтобы оно поддерживало именованный ",
        '17' =>
        ".",
    ],
];
