<?php

return [
    'title' => 'Именованный let',
    'description' => [
        '1' => "«Именованный let» — это вариант let, который имеет вид",
        '2' => "<Связывание> и <тело> такие же, как и в обычном let, но только <переменная> связана в <теле> " .
        "с процедурой, у которой тело <тело>, а имена параметров — переменные в <связываниях>. Таким образом, " .
        "можно неоднократно выполнять <тело>, вызывая процедуру по имени <переменная>. Например, итеративную " .
        "процедуру для порождения чисел Фибоначчи (раздел 1.2.2) можно переписать при помощи именованного let как,",
        '3' => "Измените преобразование let->combination из упражнения 4.6 так, чтобы оно поддерживало " .
        "именованный let.",
    ],
];
