<?php

return [
    'title' => 'Итерационные конструкции',
    'description' => [
        '1' =>
        "Во многих языках имеются различные конструкции для построения циклов, например, ",
        '2' =>
        ", ",
        '3' =>
        ", ",
        '4' =>
        " и ",
        '5' =>
        ". В Scheme итеративные процессы можно выразить через обычные вызовы процедур, так что особые " .
        "конструкции не дают никакого существенного выигрыша в вычислительной мощности. С другой стороны, часто они " .
        "удобны. Придумайте какие-нибудь конструкции для итерации, дайте примеры их использования и покажите, как их " .
        "реализовать в виде производных выражений.",
    ],
];
