<?php

return [
    'title' => "Определение регистров присутствующих в машине",
    'description' => [
        '1' =>
        "Модифицируйте имитатор так, чтобы он определял, какие регистры присутствуют в машине, из последовательности команд контроллера, а не принимал список регистров в качестве аргумента ",
        '2' =>
        ". Вместо того, чтобы выделять регистры в ",
        '3' =>
        " заранее, их можно создавать по одному, когда они встречаются в первый раз при ассемблировании команд.",
    ],
];
