<?php

return [
    'title' => "Количество сохранений и максимальная глубина стека, требуемые для вычисления n!",
    'description' => [
        '1' =>
        "Измерьте количество сохранений и максимальную глубину стека, требуемую для вычисления ",
        '2' =>
        " при различных малых значениях ",
        '3' =>
        " с помощью факториальной машины, показанной на рисунке 5.11. По этим данным определите формулы в зависимости от ",
        '4' =>
        " для числа сохранений и максимальной глубины стека, требуемых для вычисления ",
        '5' =>
        " при любом ",
        '6' =>
        ". Обратите внимание, что это линейные функции от ",
        '7' =>
        ", и они определяются двумя константами. Чтобы увидеть статистику, Вам придется добавить к факториальной машине команды для инициализации стека и распечатки статистики. " .
        "Можно также заставить машину в цикле считывать ",
        '8' =>
        ", вычислять факториал и печатать результат (как для машины НОД с рисунка 5.4), так, чтобы не нужно было все время вызывать ",
        '9' =>
        ", ",
        '10' =>
        " и ",
        '11' =>
        ".",
        '12' =>
        "Рис. 5.4. Машина НОД, которая считывает входные числа и печатает результат.",
        '13' =>
        "Рис. 5.11. Рекурсивная факториальная машина",
    ],
];
