<?php

return [
    'title' => "Стрелочная диаграмма и представление в виде вектора",
    'description' => [
        '1' =>
        "Нарисуйте стрелочную диаграмму и представление в виде вектора (как на рисунке 5.14) списка, который порождается кодом",
        '2' =>
        "если вначале указатель ",
        '3' =>
        " равен ",
        '4' =>
        ". Чему равно значение ",
        '5' =>
        " после исполнения кода? Какие указатели представляют значения ",
        '6' =>
        " и ",
        '7' =>
        "?",
        '8' =>
        "Рис. 5.14. Представления списка ((1 2) 3 4) в виде стрелочной диаграммы и в виде вектора памяти.",
    ],
];
