<?php

return [
    'title' => "Исследование хвостовой рекурсии в вычислителе",
    'description' => [
        '1' =>
        "С помощью отслеживания стека исследуйте хвостовую рекурсию в нашем вычислителе (раздел 5.4.2). Запустите вычислитель и определите итеративную процедуру ",
        '2' =>
        " из раздела 1.2.1:",
        '3' =>
        "Запустите эту процедуру с несколькими небольшими значениями ",
        '4' =>
        ". Для каждого из этих значений запишите максимальную глубину стека и количество операций сохранения, потребных для вычисления ",
        '5' =>
        ".",
        '6' =>
        "а. Вы увидите, что максимальная глубина стека, нужная для вычисления ",
        '7' =>
        ", от ",
        '8' =>
        " не зависит. Какова эта глубина? ",
        '9' =>
        "б. Составьте на основе своих данных формулу в зависимости от ",
        '10' =>
        " числа операций сохранения, необходимых для вычисления ",
        '11' =>
        " для любого ",
        '12' =>
        ". Обратите внимание, что число операций — линейная функция от ",
        '13' =>
        " и, следовательно, определяется двумя константами.",
    ],
];
