<?php

return [
    'title' => "Максимальная глубина стека и общее число сохранений, требуемых для вычисления n!",
    'description' => [
        '1' =>
        "Для сравнения с упражнением ",
        '2' =>
        ", изучите поведение следующей процедуры для рекурсивного вычисления факториала:",
        '3' =>
        "Запуская эту процедуру и отслеживая поведение стека, определите как функции от n максимальную глубину стека и общее число сохранений, требуемых для вычисления n!, при n ≥ 1. (Эти функции также будут линейны.) Опишите общие результаты экспериментов, записав в следующую таблицу соответствующие выражения как формулы, зависящие от n:",
        '4' =>
        "Максимальная глубина служит мерой объема памяти, используемой вычислителем при обработке выражения, а количество сохранений хорошо коррелирует со временем вычисления.",
    ],
];
