<?php

return [
    'title' => "Вычислитель без хвостовой рекурсии",
    'description' => [
        '1' =>
        "Измените в определении вычислителя ",
        '2' =>
        " так, как описано в разделе 5.4.2, чтобы вычислитель перестал обладать хвостовой рекурсией. Заново проведите эксперименты из упражнений ",
        '3' =>
        " и ",
        '4' =>
        " и покажите, что теперь обе версии процедуры ",
        '5' =>
        " требуют количества памяти, которое линейно зависит от значения аргумента.",
    ],
];
