<?php

return [
    'title' => "Cтек в вычислении чисел Фибоначчи с помощью древовидной рекурсии",
    'description' => [
        '1' =>
        "Проследите за использованием стека в вычислении чисел Фибоначчи с помощью древовидной рекурсии:",
        '2' =>
        "а. Дайте формулу, зависящую от ",
        '3' =>
        ", для максимальной глубины стека, требуемой при вычислении ",
        '4' =>
        " при ",
        '5' =>
        ". Подсказка: в разделе 1.2.2 мы утверждали, что требуемый объем памяти линейно зависит от ",
        '6' =>
        ".",
        '7' =>
        "б. Постройте формулу для количества сохранений, требуемых при вычислении ",
        '8' =>
        ", если ",
        '9' =>
        ". Вы увидите, что количество сохранений (которое хорошо коррелирует со временем исполнения) экспоненциально растет с ростом ",
        '10' =>
        ". Подсказка: пусть требуется ",
        '11' =>
        " сохранений при вычислении ",
        '12' =>
        " . Нужно показать, что имеется формула, которая выражает ",
        '13' =>
        " в зависимости от ",
        '14' =>
        ", ",
        '15' =>
        " и некоторой фиксированной «дополнительной» константы ",
        '16' =>
        ", независимой от ",
        '17' =>
        ". Приведите эту формулу и найдите, чему равно ",
        '18' =>
        ". Покажите теперь, что ",
        '19' =>
        " выражается как ",
        '20' =>
        " и укажите значения ",
        '21' =>
        " и ",
        '22' =>
        ".",
    ],
];
