<?php

return [
    'title' => 'Вычисление квадратных корней методом Ньютона',
    'description' => [
        '1' =>
        "Спроектируйте машину для вычисления квадратных корней методом Ньютона, как описано в разделе 1.1.7:",
        '2' =>
        "Для начала предположите, что операции ",
        '3' =>
        " и ",
        '4' =>
        " имеются как примитивы. Затем покажите, как развернуть их с помощью арифметических операций. Опишите каждую из версий машины ",
        '5' =>
        ", нарисовав диаграмму путей данных, и написав определение контроллера на языке регистровых машин.",
    ],
];
