<?php

return [
    'title' => 'Вычисление квадратных корней методом Ньютона',
    'description' => [
        '1' => "Спроектируйте машину для вычисления квадратных корней методом Ньютона, как описано в разделе 1.1.7:",
        '2' => "Для начала предположите, что операции good-enough? и improve имеются как примитивы. Затем " .
        "покажите, как развернуть их с помощью арифметических операций. Опишите каждую из версий машины sqrt, " .
        "нарисовав диаграмму путей данных, и написав определение контроллера на языке регистровых машин."
    ]
];
