<?php

return [
    'title' => "Лишние операции",
    'description' => [
        '1' =>
        "Во время вычисления вызова процедуры вычислитель с явным управлением всегда сохраняет и восстанавливает регистр ",
        '2' =>
        " при вычислении оператора, сохраняет и восстанавливает ",
        '3' =>
        " при вычислении каждого операнда (кроме последнего), сохраняет и восстанавливает ",
        '4' =>
        " при вычислении каждого операнда, а также сохраняет и восстанавливает ",
        '5' =>
        " при вычислении последовательности операндов. Для каждой из следующих комбинаций скажите, какие из этих операций ",
        '6' =>
        " и ",
        '7' =>
        " излишни и могут быть исключены с помощью механизма ",
        '8' =>
        ":",
    ],
];
