<?php

return [
    'title' => "Механизм preserving",
    'description' => [
        '1' =>
        "Вот один из способов понять, как механизм ",
        '2' =>
        " оптимизирует использование стека: рассмотреть, какие дополнительные операции порождались бы, если бы мы этот механизм не использовали. Измените ",
        '3' =>
        " так, чтобы операции ",
        '4' =>
        " и ",
        '5' =>
        " порождались всегда. Скомпилируйте несколько простых выражений и отметьте ненужные операции со стеком, которые станут порождаться. Сравните этот код с тем, который порождается, если механизм ",
        '6' =>
        " присутствует.",
    ],
];
