<?php

return [
    'title' => "Процедуры lexical-address-lookup и lexical-address-set!",
    'description' => [
        '1' =>
        "Напишите процедуру ",
        '2' =>
        ", которая реализует новую операцию поиска. Она должна брать два аргумента — лексический адрес и окружение времени компиляции, — и возвращать значение переменной, находящейся по указанному лексическому адресу. ",
        '3' =>
        " должна сообщать об ошибке, если значением переменной является символ ",
        '4' =>
        ". Кроме того, напишите процедуру ",
        '5' =>
        ", реализующую операцию, которая изменяет значение переменной по указанному лексическому адресу.",
    ],
];
