<?php

return [
    'title' => "Процедура find-variable",
    'description' => [
        '1' =>
        "Напишите процедуру ",
        '2' =>
        ", которая в качестве аргументов принимает переменную и окружение времени компиляции, а возвращает лексический адрес переменной по отношению к этому окружению. " .
        "Например, во фрагменте программы, который приведен выше, окружение времени компиляции при обработке выражения ",
        '3' =>
        " равно ",
        '4' =>
        ". ",
        '5' =>
        " должна давать",
    ],
];
