<?php

return [
    'title' => "Эффективность компиляции для процедуры Фибоначчи с древовидной рекурсией",
    'description' => [
        '1' =>
        "Проведите анализ, подобный анализу из упражнения ",
        '2' =>
        ", и определите эффективность компиляции для процедуры Фибоначчи с древовидной рекурсией",
        '3' =>
        "по сравнению с эффективностью работы специализированной машины Фибоначчи с рисунка 5.12. (Измерения интерпретируемой версии см. в упражнении ",
        '4' =>
        ".) Для процедуры Фибоначчи время растет в нелинейной зависимости от ",
        '5' =>
        "; следовательно, отношение числа стековых операций не будет приближаться к независимому от ",
        '6' =>
        " пределу.",
        '7' =>
        "Рис. 5.12. Контроллер машины для вычисления чисел Фибоначчи.",
    ],
];
