<?php

return [
    'title' => 'Метациклический интерпретатор',
    'description' => [
        '1' =>
        "С помощью компилятора оттранслируйте метациклический интерпретатор из раздела 4.1 и запустите эту программу через имитатор регистровых машин. " .
        "(Чтобы скомпилировать за раз более одного определения, можно упаковать определения в ",
        '2' =>
        ".) Получившийся интерпретатор будет работать очень медленно из-за многочисленных уровней интерпретации, однако заставить все детали работать — полезное упражнение.",
    ],
];
