<?php

return [
    'title' => "Измените процедуру extract-labels",
    'description' => [
        '1' =>
        "Следующий код для регистровой машины неоднозначен, поскольку метка ",
        '2' =>
        " определена более одного раза:",
        '3' =>
        "Каково будет содержимое регистра a в нашем имитаторе, когда управление достигнет ",
        '4' =>
        "? Измените процедуру ",
        '5' =>
        " так, чтобы ассемблер сообщал об ошибке в случае, когда одно и то же имя метки обозначает две различных точки в коде.",
    ],
];
