<?php

return [
    'title' => "Измените процедуру extract-labels",
    'description' => [
        '1' => "Следующий код для регистровой машины неоднозначен, поскольку метка here определена более " .
        "одного раза:",
        '2' => "Каково будет содержимое регистра a в нашем имитаторе, когда управление достигнет there? " .
        "Измените процедуру extract-labels так, чтобы ассемблер сообщал об ошибке в случае, когда одно и то " .
        "же имя метки обозначает две различных точки в коде."
    ]
];
