<?php

return [
    'title' => 'Функция Аккермана',
    'description' => [
        '1' =>
        "Следующая процедура вычисляет математическую функцию, называемую функцией Аккермана.",
        '2' =>
        "Каковы значения следующих выражений?",
        '3' =>
        "Рассмотрим следующие процедуры, где A — процедура, определенная выше:",
        '4' =>
        "Дайте краткие математические определения функций, вычисляемых процедурами f, g и h для положительных целых значений n. " .
        "Например, (k n) вычисляет 5 * n * n."
    ]
];
