<?php

return [
    'title' => 'О проекте',
    'description' => 'Хекслет СИКП — это сервис для тех, кто изучает книгу "Структура и интерпретация компьютерных программ".
    Отслеживайте свой прогресс и соревнуйтесь с другими, повышая свой рейтинг.',
    'welcome' => 'Добро пожаловать в open-source проект Хекслет СИКП!',
    'SICP' => 'СИКП',
    'features' => 'Возможности сервиса',
    'features_list' => [
        'Отмечать главы прочитанными',
        'Смотреть рейтинг, кто сколько прочитал',
        'Следить за активностью пользователей',
        'Обсуждать главы и задачки',
        'Отмечать пройденными упражнения',
    ],
    'What does the rating depend on?' => 'От чего зависит рейтинг?',
    'About rating' => 'Рейтинг зависит от количества прочитанных глав и пройденных упражнений. За каждые пройденные главы и упражнения вы получаете баллы, которые повышают ваш рейтинг. Упражнения в рейтинге имеют бОльший вес, практика – превыше всего! :)',
    'Guidelines' => 'Рекомендации',
    'How to learn the SICP?' => 'Как изучать СИКП?',
    'Repository with Racket settings for the SICP' => 'Репозиторий с настройками Racket для прохождения СИКП',
    'Video course' => 'Видео-курс "Структура и интерпретация компьютерных программ"',
    'MIT course' => 'Лекции от авторов курса',
    'Participate in the project' => 'Участвовать в проекте (исходный код)',
];
