<?php

return [
    'failed'      => 'Эти учетные данные не соответствуют нашим записям.',
    'throttle'    => 'Слишком много неудачных попыткок войти. Пожалуйста, повторите снова через :seconds секунд.',
    'with_github' => 'Войти через GitHub',
    'logged_in'   => 'Вы вошли!',
    'mail'        => [
        'send_link' => 'На вашу электронную почту отправлена ссылка для подтверждения регистрации',
        'verified'  => 'Электронная почта подтверждена',
    ],
    'provider_fails' => 'Ошибка авторизации или регистрации. Поробуйте другой тип',
    'logout' => 'Вы успешно вышли из аккаунта!',
];
