<?php

return [
    'title' => 'СИКП — книга об информатике (computer science)',
    'epigraph' => 'Это одна из великих классических книг об информатике.
    Я купил свой первый экземпляр 15 лет назад и до сих пор не чувствую, что выучил все, чему должна научить книга.',
    'author_of_epigraph' => 'Пол Грэм',
    'what_for' => 'Хочешь прокачаться в computer science?',
    'what_do' => 'Проходи упражнения из книги на sicp.hexlet.io и отмечай свой прогресс.',
    'this_is' => 'это',
    'content' => [
        '1' => 'разделов',
        '2' => 'упражнений',
        '3' => 'участников',
        '4' => 'комментариев',
    ],
    'features' => 'Возможности',
    'features_list' => [
        '1' => 'Отмечай прочитанные главы',
        '2' => 'Смотри рейтинг других участников',
        '3' => 'Обсуждай главы и задачи',
        '4' => 'Отмечай пройденные упражнения',
    ],
    'actions_list' => [
        '1' => 'читай',
        '2' => 'решай',
        '3' => 'общайся',
        '4' => 'стань лучшим',
    ],
    'start_learning' => 'Начать учиться',
];
