<?php

return [
    'reset' => 'Ваш пароль был успешно сброшен!',
    'sent' => 'Мы отправили вам письмо с инструкциями по восстановлению пароля!',
    'user' => 'Не удалось найти пользователя с таким e-mail адресом.',
    'reset_password' => [
        'form_header' => 'Сбросить пароль',
        'email' => 'Электронная почта',
        'password' => 'Пароль',
        'confirm_password' => 'Подтверждение пароля',
        'button' => 'Сбросить пароль',
        'button_send_link' => 'Отправить ссылку',
    ],

];
