
<?php

return [
    'show' => [
        'statistics' => [
            'rating' => 'в рейтинге',
            'points' => '{0} баллов|{1} балл|[2,4] балла|[5,*] баллов',
            'chapter_members' => '{0} разделов|{1} раздел|[2,4] раздела|[5,*] разделов',
            'all_chapters' => 'всего разделов',
            'exercise_members' => '{0} заданий|{1} задание|[2,4] задания|[5,*] заданий',
            'all_exercises' => 'всего заданий',
            'created_at' => 'В сообществе с',
            'comments' => '{0} комментариев|{1} комментарий|[2,4] комментария|[5,*] комментариев',
            'statistics' => 'Статистика',
            'chapters_progress' => 'Прогресс по главам',
            'contribution_to_community' => 'Вклад в сообщество',
            'edit_profile' => 'Редактировать профиль',
        ],
    ],
];
