
<?php

return [
    'show' => [
        'statistics' => [
            'rating' => 'в рейтинге',
            'points' => 'баллов',
            'read_chapters' => '{0} разделов|{1} раздел|[2,4] раздела|[5,*] разделов',
            'all_chapters' => 'всего разделов',
            'completed_exercises' => '{0} заданий|{1} задание|[2, 4] задания|[5, *] заданий',
            'all_exercises' => 'всего заданий',
            'created_at' => 'В сообществе с',
            'comments' => '{0} комментариев|{1} комментарий|[2,4] комментария|[5,*] комментариев',
            'statistics' => 'Статистика',
            'contribution_to_community' => 'Вклад в сообщество',
            'edit_profile' => 'Редактировать профиль',
        ],
    ],
];
