<?php

return [
    'title' => 'Хекслет СИКП',
    'what_is_here' => 'Что здесь',
    'about_sicp' => 'СИКП — книга об информатике (computer science).
                     А также о восприятии компьютеров как абстрактных машин, используемых для манипулирования данными.
                     Несмотря на то, что книга впервые опубликована в 1979, она до сих пор не потеряла свою актуальность и
                     не потеряет в будущем. СИКП неизменно находится в топе лучших книг по обучению программированию на
                     протяжении десятков лет.',
    'description' => 'Осилятор СИКП — сервис, в котором есть рейтинг тех, кто проходит СИКП, и каждый отмечает, что он прошел.',
    'features' => 'Возможности',
    'coming_soon' => 'Скоро',
    'features_list' => [
        'Отмечать главы прочитанными',
        'Смотреть рейтинг, кто сколько прочитал',
        'Следить за активностью пользователей',
        'Обсуждать главы и задачки',
        'Отмечать пройденными упражнения',
    ],
    'coming_soon_list' => [
        'Привязывать репозиторий с решёнными упражнениями',
    ],
    'comments' => [
        'latest' => 'Последние комментарии',
    ],
    'link_to_book' => 'Интерактивная версия книги SICP',
    'statistic' => [
        'title' => 'Статистика прохождения книги всеми пользователями сайта',
        'table' => [
            'per_all_time' => 'За все время',
            'per_month' => 'За месяц',
            'per_week' => 'За неделю',
            'count_read_chapter' => 'Глав прочитано',
            'count_completed_exercise' => 'Заданий выполнено',
            'count_points' => 'Количество баллов',
        ],
    ],

];
