<?php

return [
    'title' => 'Хекслет СИКП',
    'what_is_here' => 'Что здесь',
    'about_sicp' => 'СИКП — книга об информатике (computer science).
                     А также о восприятии компьютеров как абстрактных машин, используемых для манипулирования данными.
                     Несмотря на то, что книга впервые опубликована в 1979, она до сих пор не потеряла свою актуальность и
                     не потеряет в будущем. СИКП неизменно находится в топе лучших книг по обучению программированию на
                     протяжении десятков лет.',
    'description' => 'Осилятор СИКП — сервис, в котором есть рейтинг тех, кто проходит СИКП, и каждый отмечает, что он прошел.',
    'features' => 'Возможности',
    'coming_soon' => 'Скоро',
    'features_list' => [
        'Отмечать главы прочитанными',
        'Смотреть рейтинг, кто сколько прочитал',
        'Следить за активностью пользователей',
        'Обсуждать главы и задачки',
        'Отмечать пройденными упражнения',
    ],
    'coming_soon_list' => [
        'Привязывать репозиторий с решёнными упражнениями',
    ]
];
